[
  {
    "Item Type": "bookChapter",
    "Publication Year": 2024,
    "Author": "Hsu YT,Wijaya KC,Shih HC",
    "Title": "COVID-19 public transport responses in Taipei and Kaohsiung",
    "Short Title": "",
    "Publication Title": "",
    "DOI": "10.1016/b978-0-443-13295-7.00009-5",
    "Url": "http://dx.doi.org/10.1016/b978-0-443-13295-7.00009-5",
    "Abstract Note": "",
    "Date": "2024",
    "Pages": "177-189",
    "Issue": "",
    "Volume": "",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2025,
    "Author": "Shih HC,Wijaya KC,Hsueh HY,Hsu YT",
    "Title": "Away from over-populated development: Estimating urban carrying capacity with an integrated perspective of transportation and urban planning",
    "Short Title": "Transp. Policy (Oxf.)",
    "Publication Title": "",
    "DOI": "10.1016/j.tranpol.2024.12.010",
    "Url": "http://dx.doi.org/10.1016/j.tranpol.2024.12.010",
    "Abstract Note": "",
    "Date": "2025-03",
    "Pages": "283-295",
    "Issue": "",
    "Volume": "162",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2024,
    "Author": "Shih HC,Hsu YT,Lai YC",
    "Title": "Modeling non-compensatory strategies on path choices in a complex urban rail transit network considering characteristics of transfer passengers and trips",
    "Short Title": "Travel Behav. Soc.",
    "Publication Title": "",
    "DOI": "10.1016/j.tbs.2023.100733",
    "Url": "http://dx.doi.org/10.1016/j.tbs.2023.100733",
    "Abstract Note": "",
    "Date": "2024-04",
    "Pages": "100733",
    "Issue": "100733",
    "Volume": "35",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2022,
    "Author": "Sun MC,Sakai K,Chen AY,Hsu YT",
    "Title": "Location problems of vertical evacuation structures for dam-failure floods: Considering shelter-in-place and horizontal evacuation",
    "Short Title": "Int. J. Disaster Risk Reduct.",
    "Publication Title": "",
    "DOI": "10.1016/j.ijdrr.2022.103044",
    "Url": "http://dx.doi.org/10.1016/j.ijdrr.2022.103044",
    "Abstract Note": "",
    "Date": "2022-07",
    "Pages": "103044",
    "Issue": "103044",
    "Volume": "77",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2022,
    "Author": "Chou CY,Lin SY,Yang CT,Hsu YT",
    "Title": "Risk perception of earthquakes: Modeling conception of willingness to pay and prospect theory",
    "Short Title": "Int. J. Disaster Risk Reduct.",
    "Publication Title": "",
    "DOI": "10.1016/j.ijdrr.2022.103058",
    "Url": "http://dx.doi.org/10.1016/j.ijdrr.2022.103058",
    "Abstract Note": "",
    "Date": "2022-07",
    "Pages": "103058",
    "Issue": "103058",
    "Volume": "77",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2022,
    "Author": "Su YM,Chen JH,Cheng JY,Hsu YT,Huang MC",
    "Title": "Rough-set based association rules toward performance of high-friction road markings",
    "Short Title": "J. Transp. Eng. B Pavements",
    "Publication Title": "",
    "DOI": "10.1061/jpeodx.0000355",
    "Url": "http://dx.doi.org/10.1061/jpeodx.0000355",
    "Abstract Note": "",
    "Date": "2022-06",
    "Pages": "",
    "Issue": "2",
    "Volume": "148",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2022,
    "Author": "Chang RY,Sakai K,Hsu YT",
    "Title": "",
    "Short Title": "J. East. Asia Soc. Transp. Stud.",
    "Publication Title": "",
    "DOI": "10.11175/easts.14.1553",
    "Url": "http://dx.doi.org/10.11175/easts.14.1553",
    "Abstract Note": "",
    "Date": "2022-03-11",
    "Pages": "1553-1567",
    "Issue": "0",
    "Volume": "14",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2022,
    "Author": "Ni YC,Lo HH,Hsu YT,Huang HJ",
    "Title": "Exploring the effects of passive transit signal priority design on bus rapid transit operation: a microsimulation-based optimization approach",
    "Short Title": "Transp. Lett.",
    "Publication Title": "",
    "DOI": "10.1080/19427867.2020.1805681",
    "Url": "http://dx.doi.org/10.1080/19427867.2020.1805681",
    "Abstract Note": "",
    "Date": "2022-01-02",
    "Pages": "14-27",
    "Issue": "1",
    "Volume": "14",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2021,
    "Author": "Hsu YT,Yan S,Huang P",
    "Title": "The depot and charging facility location problem for electrifying urban bus services",
    "Short Title": "Transp. Res. D Transp. Environ.",
    "Publication Title": "",
    "DOI": "10.1016/j.trd.2021.103053",
    "Url": "http://dx.doi.org/10.1016/j.trd.2021.103053",
    "Abstract Note": "",
    "Date": "2021-11",
    "Pages": "103053",
    "Issue": "103053",
    "Volume": "100",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2021,
    "Author": "Hsiao CC,Sun MC,Chen AY,Hsu YT",
    "Title": "Location problems for shelter-in-place deployment: A case study of vertical evacuation upon dam-break floods",
    "Short Title": "Int. J. Disaster Risk Reduct.",
    "Publication Title": "",
    "DOI": "10.1016/j.ijdrr.2021.102048",
    "Url": "http://dx.doi.org/10.1016/j.ijdrr.2021.102048",
    "Abstract Note": "",
    "Date": "2021-04",
    "Pages": "102048",
    "Issue": "102048",
    "Volume": "57",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2021,
    "Author": "Wang PC,Hsu YT,Hsu CW",
    "Title": "Analysis of waiting time perception of bus passengers provided with mobile service",
    "Short Title": "Transp. Res. Part A Policy Pract.",
    "Publication Title": "",
    "DOI": "10.1016/j.tra.2021.01.011",
    "Url": "http://dx.doi.org/10.1016/j.tra.2021.01.011",
    "Abstract Note": "",
    "Date": "2021-03",
    "Pages": "319-336",
    "Issue": "",
    "Volume": "145",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2020,
    "Author": "Miralinaghi M,Seilabi SE,Chen S,Hsu YT,Labi S",
    "Title": "Optimizing the selection and scheduling of multi-class projects using a Stackelberg framework",
    "Short Title": "Eur. J. Oper. Res.",
    "Publication Title": "",
    "DOI": "10.1016/j.ejor.2020.03.051",
    "Url": "http://dx.doi.org/10.1016/j.ejor.2020.03.051",
    "Abstract Note": "",
    "Date": "2020-10",
    "Pages": "508-522",
    "Issue": "2",
    "Volume": "286",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2020,
    "Author": "Lee WY,Hsu YT,Suen CS,Wu MH,Ni YC",
    "Title": "Exploring intercity trip patterns of railway systems on national holidays using deep auto-encoder",
    "Short Title": "Transp. Res. Rec.",
    "Publication Title": "",
    "DOI": "10.1177/0361198120917385",
    "Url": "http://dx.doi.org/10.1177/0361198120917385",
    "Abstract Note": "Intercity railway system operation on national holidays can be challenging because of possible surging demand. This study proposes an analysis framework to investigate railway system ridership data on national holidays, seeking to attain better understanding of relevant intercity trip patterns, so as to enable enhanced preparation and response before and during national holidays. The ridership data are analyzed in the form of Origin–Destination (O-D) tables and regarded as pictures of N × N pixels, where N is the number of the considered stations/cities in a railway system. The framework primarily adopts a deep auto-encoder to process these pictures to reduce data dimensions and abstracting key features within these pictorial data. Based on the abstracted features, k-means clustering is then conducted to categorize the O-D tables with similar trip patterns into the same group. Further, a discrete outcome model based on logistic regression is developed on the clustering results to enhance the interpretation of the trip pattern in each group and identify the significant holiday-related characteristics and external factors that can affect the trip pattern generation. The ridership data of Taiwan Railways Administration associated with 38 national holidays from January 2014 to August 2018 are analyzed. The analysis results highlight insightful interpretation in relation to clustered trip patterns and relevant trip characterization relative to various national holidays. The proposed framework and developed discrete outcome model are also validated, showing 85% correct assignments of O-D tables to the groups of relevant trip patterns.",
    "Date": "2020-05",
    "Pages": "662-672",
    "Issue": "5",
    "Volume": "2674",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2019,
    "Author": "Chen PA,Wu HT,Hsu YT",
    "Title": "",
    "Short Title": "J. East. Asia Soc. Transp. Stud.",
    "Publication Title": "",
    "DOI": "10.11175/easts.13.2598",
    "Url": "http://dx.doi.org/10.11175/easts.13.2598",
    "Abstract Note": "",
    "Date": "2019-12-31",
    "Pages": "2598-2613",
    "Issue": "0",
    "Volume": "13",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2019,
    "Author": "Chu JC,Korsesthakarn K,Hsu YT,Wu HY",
    "Title": "Models and a solution algorithm for planning transfer synchronization of bus timetables",
    "Short Title": "Transp. Res. Part E: Logist. Trans. Rev.",
    "Publication Title": "",
    "DOI": "10.1016/j.tre.2019.10.001",
    "Url": "http://dx.doi.org/10.1016/j.tre.2019.10.001",
    "Abstract Note": "",
    "Date": "2019-11",
    "Pages": "247-266",
    "Issue": "",
    "Volume": "131",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2019,
    "Author": "Wu YH,Kang L,Hsu YT,Wang PC",
    "Title": "Exploring trip characteristics of bike-sharing system uses: Effects of land-use patterns and pricing scheme change",
    "Short Title": "Int. J. Transp. Sci. Technol.",
    "Publication Title": "",
    "DOI": "10.1016/j.ijtst.2019.05.003",
    "Url": "http://dx.doi.org/10.1016/j.ijtst.2019.05.003",
    "Abstract Note": "",
    "Date": "2019-09",
    "Pages": "318-331",
    "Issue": "3",
    "Volume": "8",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2018,
    "Author": "Chang TH,Tseng JS,Hsieh TH,Hsu YT,Lu YC",
    "Title": "Green transportation implementation through distance-based road pricing",
    "Short Title": "Transp. Res. Part A Policy Pract.",
    "Publication Title": "",
    "DOI": "10.1016/j.tra.2018.02.015",
    "Url": "http://dx.doi.org/10.1016/j.tra.2018.02.015",
    "Abstract Note": "The implementation of electronic toll collection (ETC) over freeways not only enables nonstop traffic flows through toll collection zones but also facilitates more flexible schemes for road pricing, such as distance-based and time-based schemes, as both the on-ramp and off-ramp time stamps of a trip can be detected. Based on such an ETC environment, this study develops a road pricing model which considers the perspectives of road users, the government, and the ETC agent, seeking to attain greener transportation by leveraging the external costs related to environmental impact and accident potential. Thereupon, a Green Safety Indicator (GSI) is proposed to comprehensively account for the service level of freeway traffic. The optimal solution for the benefits generated from three scenarios are determined against GSI-based equilibria, which can maintain the revenue for the government, offer the ETC agent higher profits, and allow road users off-peak discounts, thereby promoting a tripartite win–win situation among stakeholders.",
    "Date": "2018-05",
    "Pages": "53-64",
    "Issue": "",
    "Volume": "111",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2017,
    "Author": "Chien ST,Hsu YT",
    "Title": "",
    "Short Title": "J. East. Asia Soc. Transp. Stud.",
    "Publication Title": "",
    "DOI": "10.11175/easts.12.784",
    "Url": "http://dx.doi.org/10.11175/easts.12.784",
    "Abstract Note": "",
    "Date": "2017-04-25",
    "Pages": "784-803",
    "Issue": "0",
    "Volume": "12",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2016,
    "Author": "Miralinaghi M,Lou Y,Hsu Y,Shabanpour R,Shafahi Y",
    "Title": "Multiclass fuzzy user equilibrium with endogenous membership functions and risk‐taking behaviors",
    "Short Title": "J. Adv. Transp.",
    "Publication Title": "",
    "DOI": "10.1002/atr.1425",
    "Url": "http://dx.doi.org/10.1002/atr.1425",
    "Abstract Note": "SummaryOver the last decades, several approaches have been proposed in the literature to incorporate users' perceptions of travel costs, their bounded rationality, and risk‐taking behaviors into network equilibrium modeling for traffic assignment problem. While theoretically advanced, these models often suffer from high complexity and computational cost and often involve parameters that are difficult to estimate. This study proposes an alternative approach where users' imprecise perceptions of travel times are endogenously constructed as fuzzy sets based on the probability distributions of random link travel times. Two decision rules are proposed accordingly to account for users' heterogeneous risk‐taking behaviors, that is, optimistic and pessimistic rules. The proposed approach, namely, the multiclass fuzzy user equilibrium, can be formulated as a link‐based variational inequality model. The model can be solved efficiently, and parameters involved can be either easily estimated or treated as factors for calibration against observed traffic flow data. Numerical examples show that the proposed model can be solved efficiently even for a large‐scale network of Mashhad, Iran, with 2538 links and 7157 origin–destination pairs. The example also illustrates the calibration capability of the proposed model, highlighting that the model is able to produce much more accurate flow estimates compared with the Wardropian user equilibrium model. Copyright © 2016 John Wiley & Sons, Ltd.",
    "Date": "2016-12",
    "Pages": "1716-1734",
    "Issue": "8",
    "Volume": "50",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2016,
    "Author": "Hsu YT,Kang L,Wu YH",
    "Title": "User behavior of bikesharing systems under demand–supply imbalance",
    "Short Title": "Transp. Res. Rec.",
    "Publication Title": "",
    "DOI": "10.3141/2587-14",
    "Url": "http://dx.doi.org/10.3141/2587-14",
    "Abstract Note": "Bikesharing systems have been expanding rapidly. They are recognized as a strategic tool to integrate transit and to foster sustainable transportation in urban areas. A critical problem that arises in the planning and deployment of a bikesharing system lies in demand–supply imbalance as the result of the spatiotemporal dynamics of demand patterns. The problem manifests itself in situations in which no bikes are available to rent and no docks are available for bike return at certain popular stations. This study developed a framework for modeling user behavior in response to such situations. Particular emphasis was placed on user on-site choice behavior and the behavioral aspect related to wait time if a decision to wait for the next bike or dock was made. These behaviors were approached with the use of a discrete choice model and a duration model, respectively. Further, a discrete-continuous process was proposed to address the potential interrelation that existed between the choice to wait and the length of waiting time to be endured. Within the developed framework, the models were estimated on the basis of the data from a revealed preference–stated preference survey conducted on the YouBike system in Taipei, Taiwan. The estimation results provided insights into user familiarity and uncertainty toward the system, travel situation, or environment and the associated effects on user behavior of a bikesharing system under a demand–supply imbalance.",
    "Date": "2016-01",
    "Pages": "117-124",
    "Issue": "1",
    "Volume": "2587",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2016,
    "Author": "Chang TH,Chen AY,Hsu YT,Yang CL",
    "Title": "Freeway travel time prediction based on seamless spatio-temporal data fusion: Case study of the freeway in Taiwan",
    "Short Title": "Transp. Res. Procedia",
    "Publication Title": "",
    "DOI": "10.1016/j.trpro.2016.11.087",
    "Url": "http://dx.doi.org/10.1016/j.trpro.2016.11.087",
    "Abstract Note": "Travel time prediction has been the fundamental brick for developing both Advanced Traffic Management Systems (ATMS) and Advanced Traveler Information Systems (ATIS). The problem of travel time prediction is primarily shaped by the data available for model development and the needs from the perspectives of both travelers and operators. A distance-based Electronic Toll Collection (ETC) system over the freeway system in Taiwan has been fully implemented since December 2013, which provides more comprehensive online data acquisition of freeway traffic conditions, thereby enabling the capability to more reliably predict of travel time over freeway segments. Based on the data from both the ETC system and traditional Vehicle Detectors (VDs), this research proposes a travel time prediction approach whose core technique of data fusion seeks to seamlessly capture the spatio-temporal pattern of freeway traffic flows by matching traffic dynamics revealed from the ETC and VD data. Further, prediction models are constructed thereupon, where the Kalman filter is employed for short-term prediction and the Fourier transform for long-term prediction based on the continuous parameterized modeling of spot travel speed. The proposed approach is implemented as an online deployable system using Java, together with real-world data collected from the freeway in Taiwan, for the numerical experiments. The prediction errors are no greater than 10% in most cases, which illustrates the high accuracy of prediction capability of the model. The encouraging results also highlight the benefits of the pre-processing of data and data fusion in improving data quality and applicability.",
    "Date": "2016",
    "Pages": "452-459",
    "Issue": "",
    "Volume": "17",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2015,
    "Author": "Hsu YT,Peeta S",
    "Title": "Clearance time estimation for incorporating evacuation risk in routing strategies for evacuation operations",
    "Short Title": "Netw. Spat. Econ.",
    "Publication Title": "",
    "DOI": "10.1007/s11067-013-9195-5",
    "Url": "http://dx.doi.org/10.1007/s11067-013-9195-5",
    "Abstract Note": "",
    "Date": "2015-09",
    "Pages": "743-764",
    "Issue": "3",
    "Volume": "15",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2014,
    "Author": "Hsu YT,Peeta S",
    "Title": "Behavior-consistent information-based network traffic control for evacuation operations",
    "Short Title": "Transp. Res. Part C Emerg. Technol.",
    "Publication Title": "",
    "DOI": "10.1016/j.trc.2014.08.025",
    "Url": "http://dx.doi.org/10.1016/j.trc.2014.08.025",
    "Abstract Note": "The evacuation operations problem aims to avoid or mitigate the potential loss of life in a region threatened or affected by a disaster. It is shaped to a large extent by the evolution of evacuation traffic resulting from the demand–supply interactions of the associated transportation network. Information-based control is a strategic tool for evacuation traffic operations as it can enable greater access to the affected population and more effective response. However, comparatively few studies have focused on the implementation of information-based control in evacuation operations. This study develops a control module for evacuation operations centered on addressing the demand–supply interactions by using behavior-consistent information strategies. These strategies incorporate the likely responses of evacuees to the information provided in the determination of route guidance information. The control module works as an iterative computational process involving an evacuee route choice model and a control model of information strategies to determine the route guidance information to direct evacuation traffic so as to approach a desired network traffic flow pattern. The problem is formulated as a fuzzy logic based optimization framework to explicitly incorporate practical concerns related to information dissemination characteristics and social equity in evacuation operations. Numerical experiments highlight the importance of accounting for the demand–supply interactions, as the use of behavior-consistent information strategies can lead evacuee route choices to approach the operator-desired proportions corresponding to the desired traffic pattern. The results also indicate that while a behavior-consistent information strategy can be effective, gaps with the desired route proportions can exist due to the discrete nature of the linguistic messages and the real-world difficulty in accurately modeling evacuees’ actual route choice behavior.",
    "Date": "2014-11",
    "Pages": "339-359",
    "Issue": "",
    "Volume": "48",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2014,
    "Author": "Hsu YT,Peeta S",
    "Title": "Risk-based spatial zone determination problem for stage-based evacuation operations",
    "Short Title": "Transp. Res. Part C Emerg. Technol.",
    "Publication Title": "",
    "DOI": "10.1016/j.trc.2014.01.013",
    "Url": "http://dx.doi.org/10.1016/j.trc.2014.01.013",
    "Abstract Note": "This study seeks to determine risk-based evacuation subzones for stage-based evacuation operations in a region threatened/affected by a disaster so that information-based evacuation strategies can be implemented in real-time for the subzone currently with highest evacuation risk to achieve some system-level performance objectives. Labeled the evacuation risk zone (ERZ), this subzone encompasses the spatial locations containing the population with highest evacuation risk which is a measure based on whether the population at a location can be safely evacuated before the disaster impacts it. The ERZ for a stage is calculated based on the evolving disaster characteristics, traffic demand pattern, and network supply conditions over the region in real-time subject to the resource limitations (personnel, equipment, etc.) of the disaster response operators related to implementing the evacuation strategies. Thereby, the estimated time-dependent lead time to disaster impact at a location and the estimated time-dependent clearance time based on evolving traffic conditions are used to compute evacuation risk. This time-unit measure of evacuation risk enables the ERZ concept to be seamlessly applied to different types of disasters, providing a generalized framework for mass evacuation operations in relation to disaster characteristics. Numerical experiments conducted to analyze the performance of the ERZ-based paradigm highlight its benefits in terms of better adapting to the dynamics of disaster impact and ensuring a certain level of operational performance effectiveness benchmarked against the idealized system optimal traffic pattern for the evacuation operation, while efficiently utilizing available disaster response resources.",
    "Date": "2014-04",
    "Pages": "73-89",
    "Issue": "",
    "Volume": "41",
    "Library Catalog": ""
  },
  {
    "Item Type": "journalArticle",
    "Publication Year": 2013,
    "Author": "Hsu YT,Peeta S",
    "Title": "An aggregate approach to model evacuee behavior for no-notice evacuation operations",
    "Short Title": "Transportation (Amst.)",
    "Publication Title": "",
    "DOI": "10.1007/s11116-012-9440-7",
    "Url": "http://dx.doi.org/10.1007/s11116-012-9440-7",
    "Abstract Note": "",
    "Date": "2013-05",
    "Pages": "671-696",
    "Issue": "3",
    "Volume": "40",
    "Library Catalog": ""
  }
]