[
    {
        "Item Type": "journalArticle",
        "Publication Year": 2014,
        "Author": "Hsu, Yu-Ting; Peeta, Srinivas",
        "Title": "Risk-based spatial zone determination problem for stage-based evacuation operations",
        "Short Title": "",
        "Publication Title": "Transportation Research Part C: Emerging Technologies",
        "DOI": "https://doi.org/10.1016/j.trc.2014.01.013",
        "Url": "https://doi.org/10.1016/j.trc.2014.01.013",
        "Abstract Note": "",
        "Date": "2014-04-01",
        "Pages": "73-89",
        "Issue": "",
        "Volume": "41",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2012,
        "Author": "Hsu, Yu-Ting; Peeta, Srinivas",
        "Title": "An aggregate approach to model evacuee behavior for no-notice evacuation operations",
        "Short Title": "",
        "Publication Title": "Transportation",
        "DOI": "https://doi.org/10.1007/s11116-012-9440-7",
        "Url": "https://doi.org/10.1007/s11116-012-9440-7",
        "Abstract Note": "",
        "Date": "2012-10-07",
        "Pages": "671-696",
        "Issue": "3",
        "Volume": "40",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Hsu, Yu-Ting; Yan, Shangyao; Huang, Powei",
        "Title": "The depot and charging facility location problem for electrifying urban bus services",
        "Short Title": "",
        "Publication Title": "Transportation Research Part D: Transport and Environment",
        "DOI": "https://doi.org/10.1016/j.trd.2021.103053",
        "Url": "https://doi.org/10.1016/j.trd.2021.103053",
        "Abstract Note": "",
        "Date": "2021-11-01",
        "Pages": "103053",
        "Issue": "",
        "Volume": "100",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2019,
        "Author": "Chu, James C.; Korsesthakarn, Kanticha; Hsu, Yu-Ting; Wu, Hua-Yen",
        "Title": "Models and a solution algorithm for planning transfer synchronization of bus timetables",
        "Short Title": "",
        "Publication Title": "Transportation Research Part E: Logistics and Transportation Review",
        "DOI": "https://doi.org/10.1016/j.tre.2019.10.001",
        "Url": "https://doi.org/10.1016/j.tre.2019.10.001",
        "Abstract Note": "",
        "Date": "2019-11-01",
        "Pages": "247-266",
        "Issue": "",
        "Volume": "131",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2018,
        "Author": "Chang, Tang-Hsien; Tseng, Jen-Sung; Hsieh, Tung-Hung; Hsu, Yu-Ting; Lu, Ying-Chih",
        "Title": "Green transportation implementation through distance-based road pricing",
        "Short Title": "",
        "Publication Title": "Transportation Research Part A: Policy and Practice",
        "DOI": "https://doi.org/10.1016/j.tra.2018.02.015",
        "Url": "https://doi.org/10.1016/j.tra.2018.02.015",
        "Abstract Note": "",
        "Date": "2018-05-01",
        "Pages": "53-64",
        "Issue": "",
        "Volume": "111",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2013,
        "Author": "Hsu, Yu-Ting; Peeta, Srinivas",
        "Title": "Clearance Time Estimation for Incorporating Evacuation Risk in Routing Strategies for Evacuation Operations",
        "Short Title": "",
        "Publication Title": "Networks and Spatial Economics",
        "DOI": "https://doi.org/10.1007/s11067-013-9195-5",
        "Url": "https://doi.org/10.1007/s11067-013-9195-5",
        "Abstract Note": "",
        "Date": "2013-06-14",
        "Pages": "743-764",
        "Issue": "3",
        "Volume": "15",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2016,
        "Author": "Miralinaghi, Mohammad; Lou, Yingyan; Hsu, Yu‐Ting; Shabanpour, Ramin; Shafahi, Yousef",
        "Title": "Multiclass fuzzy user equilibrium with endogenous membership functions and risk‐taking behaviors",
        "Short Title": "",
        "Publication Title": "Journal of Advanced Transportation",
        "DOI": "https://doi.org/10.1002/atr.1425",
        "Url": "https://doi.org/10.1002/atr.1425",
        "Abstract Note": "<jats:title>Summary</jats:title><jats:p>Over the last decades, several approaches have been proposed in the literature to incorporate users' perceptions of travel costs, their bounded rationality, and risk‐taking behaviors into network equilibrium modeling for traffic assignment problem. While theoretically advanced, these models often suffer from high complexity and computational cost and often involve parameters that are difficult to estimate. This study proposes an alternative approach where users' imprecise perceptions of travel times are endogenously constructed as fuzzy sets based on the probability distributions of random link travel times. Two decision rules are proposed accordingly to account for users' heterogeneous risk‐taking behaviors, that is, optimistic and pessimistic rules. The proposed approach, namely, the multiclass fuzzy user equilibrium, can be formulated as a link‐based variational inequality model. The model can be solved efficiently, and parameters involved can be either easily estimated or treated as factors for calibration against observed traffic flow data. Numerical examples show that the proposed model can be solved efficiently even for a large‐scale network of Mashhad, Iran, with 2538 links and 7157 origin–destination pairs. The example also illustrates the calibration capability of the proposed model, highlighting that the model is able to produce much more accurate flow estimates compared with the Wardropian user equilibrium model. Copyright © 2016 John Wiley &amp; Sons, Ltd.</jats:p>",
        "Date": "2016-10-27",
        "Pages": "1716-1734",
        "Issue": "8",
        "Volume": "50",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2020,
        "Author": "Ni, Ying-Chuan; Lo, Hsien-Hao; Hsu, Yu-Ting; Huang, Hung-Jen",
        "Title": "Exploring the effects of passive transit signal priority design on bus rapid transit operation: a microsimulation-based optimization approach",
        "Short Title": "",
        "Publication Title": "Transportation Letters",
        "DOI": "https://doi.org/10.1080/19427867.2020.1805681",
        "Url": "https://doi.org/10.1080/19427867.2020.1805681",
        "Abstract Note": "",
        "Date": "2020-08-19",
        "Pages": "14-27",
        "Issue": "1",
        "Volume": "14",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2019,
        "Author": "Wu, Yi-Hsuan; Kang, Lei; Hsu, Yu-Ting; Wang, Po-Chieh",
        "Title": "Exploring trip characteristics of bike-sharing system uses: Effects of land-use patterns and pricing scheme change",
        "Short Title": "",
        "Publication Title": "International Journal of Transportation Science and Technology",
        "DOI": "https://doi.org/10.1016/j.ijtst.2019.05.003",
        "Url": "https://doi.org/10.1016/j.ijtst.2019.05.003",
        "Abstract Note": "",
        "Date": "2019-09-01",
        "Pages": "318-331",
        "Issue": "3",
        "Volume": "8",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2020,
        "Author": "Miralinaghi, Mohammad; Seilabi, Sania E.; Chen, Sikai; Hsu, Yu-Ting; Labi, Samuel",
        "Title": "Optimizing the selection and scheduling of multi-class projects using a Stackelberg framework",
        "Short Title": "",
        "Publication Title": "European Journal of Operational Research",
        "DOI": "https://doi.org/10.1016/j.ejor.2020.03.051",
        "Url": "https://doi.org/10.1016/j.ejor.2020.03.051",
        "Abstract Note": "",
        "Date": "2020-10-01",
        "Pages": "508-522",
        "Issue": "2",
        "Volume": "286",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Hsiao, Chun-Chien; Sun, Min-Ci; Chen, Albert Y.; Hsu, Yu-Ting",
        "Title": "Location problems for shelter-in-place deployment: A case study of vertical evacuation upon dam-break floods",
        "Short Title": "",
        "Publication Title": "International Journal of Disaster Risk Reduction",
        "DOI": "https://doi.org/10.1016/j.ijdrr.2021.102048",
        "Url": "https://doi.org/10.1016/j.ijdrr.2021.102048",
        "Abstract Note": "",
        "Date": "2021-04-01",
        "Pages": "102048",
        "Issue": "",
        "Volume": "57",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2014,
        "Author": "Hsu, Yu-Ting; Peeta, Srinivas",
        "Title": "Behavior-consistent information-based network traffic control for evacuation operations",
        "Short Title": "",
        "Publication Title": "Transportation Research Part C: Emerging Technologies",
        "DOI": "https://doi.org/10.1016/j.trc.2014.08.025",
        "Url": "https://doi.org/10.1016/j.trc.2014.08.025",
        "Abstract Note": "",
        "Date": "2014-11-01",
        "Pages": "339-359",
        "Issue": "",
        "Volume": "48",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Wang, Po-Chieh; Hsu, Yu-Ting; Hsu, Chia-Wei",
        "Title": "Analysis of waiting time perception of bus passengers provided with mobile service",
        "Short Title": "",
        "Publication Title": "Transportation Research Part A: Policy and Practice",
        "DOI": "https://doi.org/10.1016/j.tra.2021.01.011",
        "Url": "https://doi.org/10.1016/j.tra.2021.01.011",
        "Abstract Note": "",
        "Date": "2021-03-01",
        "Pages": "319-336",
        "Issue": "",
        "Volume": "145",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2016,
        "Author": "Hsu, Yu-Ting; Kang, Lei; Wu, Yi-Hsuan",
        "Title": "User Behavior of Bikesharing Systems Under Demand–Supply Imbalance",
        "Short Title": "",
        "Publication Title": "Transportation Research Record: Journal of the Transportation Research Board",
        "DOI": "https://doi.org/10.3141/2587-14",
        "Url": "https://doi.org/10.3141/2587-14",
        "Abstract Note": "<jats:p> Bikesharing systems have been expanding rapidly. They are recognized as a strategic tool to integrate transit and to foster sustainable transportation in urban areas. A critical problem that arises in the planning and deployment of a bikesharing system lies in demand–supply imbalance as the result of the spatiotemporal dynamics of demand patterns. The problem manifests itself in situations in which no bikes are available to rent and no docks are available for bike return at certain popular stations. This study developed a framework for modeling user behavior in response to such situations. Particular emphasis was placed on user on-site choice behavior and the behavioral aspect related to wait time if a decision to wait for the next bike or dock was made. These behaviors were approached with the use of a discrete choice model and a duration model, respectively. Further, a discrete-continuous process was proposed to address the potential interrelation that existed between the choice to wait and the length of waiting time to be endured. Within the developed framework, the models were estimated on the basis of the data from a revealed preference–stated preference survey conducted on the YouBike system in Taipei, Taiwan. The estimation results provided insights into user familiarity and uncertainty toward the system, travel situation, or environment and the associated effects on user behavior of a bikesharing system under a demand–supply imbalance. </jats:p>",
        "Date": "2016-01-01",
        "Pages": "117-124",
        "Issue": "1",
        "Volume": "2587",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2009",
        "Author": "Srinivas Peeta; Yu-Ting Hsu",
        "Title": "Integrating supply and demand aspects of transportation for mass evacuation under disasters.",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study seeks to address real-time operational needs in the context of the evacuation response problem by providing a capability to dynamically route vehicles under evacuation, thereby being responsive to the actual conditions unfolding in real-time in the traffic network, both in terms of the evolving traffic patterns (demand-side) and the available road infrastructure in the aftermath of the disaster (supply-side). A key aspect in evacuation operations which is not well-understood is the interplay between route choice behavior and its effect on traffic and supply dynamics (i.e., composition of evacuation traffic, changes in roadway capacities, etc.). Evacuation traffic has historically been quantified with descriptive surveys characterizing the behavioral aspects from social or psychological contexts. Integration of these behavioral aspects into traffic and/or supply-side models has been limited. This study seeks to address such integration for generating realistic and effective evacuation strategies by focusing on developing behavioral models for no-notice mass evacuation. They include: (i) an evacuation participation decision model that determines whether an individual or a group of individuals would evacuate at the current time in a disaster context, and (ii) an evacuation route choice model that determines the routes taken by individuals or groups of individuals after they take a decision to evacuate. Under a comprehensive framework which integrates the management of demand- and supply-side components, this study focuses on the modeling of behavior under no-notice evacuation, which has rarely been emphasized in previous studies, especially in …",
        "Date": "",
        "Pages": "",
        "Issue": "019PY01",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2015",
        "Author": "Yu-Ting Hsu; Wei-Ren Lin; Yung-Cheng Rex Lai; TCT Kao",
        "Title": "Forecasting High-speed Rail Ridership Using Aggregate Data: A case Revisit of High speed rail in Taiwan",
        "Short Title": "",
        "Publication Title": "TRB 94th Annual Meeting Compendium of Paper.–2015",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Forecasting High Speed Rail Ridership Using Aggregate Data: Page 1 Yu-Ting Hsu, Wei-Ren \nLin, Yung-Cheng (Rex) Lai, and Tsung-Chung (TC) Kao Forecasting High Speed Rail \nRidership Using Aggregate Data: A Case Revisit of High Speed Rail in Taiwan Transportation \nResearch Board 2015, Washington DC Department of Civil Engineering, National Taiwan \nUniversity Railroad Transportation & Engineering Center (RailTEC) Page 2 Background 2 ► \nHigh Speed Rail (HSR) to address continuously increasing global vehicular demand ► The \ntrend of HSR development - Looking backward to the past 50 years First HSR system: \nShinkansen between Tokyo and Osaka in 1964 - Recent trend (by November 2013) • 21,472 \nkm of HSR lines in operation • 13,964 km under construction (70% in developing countries) • \n16,347 km planned Page 3 Background: The Challenges 3 ► Failure of ridership forecasting (…",
        "Date": "",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Chou, Chi-Ya; Lin, Szu-Yun; Yang, Cheng-Tao; Hsu, Yu-Ting",
        "Title": "Risk Perception of Earthquakes: Modeling Conception of Willingness to Pay and Prospect Theory",
        "Short Title": "",
        "Publication Title": "SSRN Electronic Journal",
        "DOI": "https://doi.org/10.2139/ssrn.3995116",
        "Url": "https://doi.org/10.2139/ssrn.3995116",
        "Abstract Note": "",
        "Date": "2021-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2016,
        "Author": "Chang, Tang-Hsien; Chen, Albert Y.; Hsu, Yu-Ting; Yang, Chien-Li",
        "Title": "Freeway Travel Time Prediction Based on Seamless Spatio-temporal Data Fusion: Case Study of the Freeway in Taiwan",
        "Short Title": "",
        "Publication Title": "Transportation Research Procedia",
        "DOI": "https://doi.org/10.1016/j.trpro.2016.11.087",
        "Url": "https://doi.org/10.1016/j.trpro.2016.11.087",
        "Abstract Note": "",
        "Date": "2016-01-01",
        "Pages": "452-459",
        "Issue": "",
        "Volume": "17",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Sun, Min-Ci; Sakai, Katsuya; Chen, Albert Y.; Hsu, Yu-Ting",
        "Title": "Location problems of vertical evacuation structures for dam-failure floods: Considering shelter-in-place and horizontal evacuation",
        "Short Title": "",
        "Publication Title": "International Journal of Disaster Risk Reduction",
        "DOI": "https://doi.org/10.1016/j.ijdrr.2022.103044",
        "Url": "https://doi.org/10.1016/j.ijdrr.2022.103044",
        "Abstract Note": "",
        "Date": "2022-07-01",
        "Pages": "103044",
        "Issue": "",
        "Volume": "77",
        "Library Catalog": ""
    },
    {
        "Item Type": "proceedingsArticle",
        "Publication Year": 2017,
        "Author": "Song, Dongyoon; Peeta, Srinivas; Hsu, Yu-ting; Agrawal, Shubham",
        "Title": "Role of Psychological Effects of Real-Time Travel Information Provision on En Route Traveler Route Choice Decisions",
        "Short Title": "",
        "Publication Title": "Proceedings of the 9th International Driving Symposium on Human Factors in Driver Assessment, Training, and Vehicle Design: driving assessment 2017",
        "DOI": "https://doi.org/10.17077/drivingassessment.1647",
        "Url": "https://doi.org/10.17077/drivingassessment.1647",
        "Abstract Note": "",
        "Date": "2017-01-01",
        "Pages": "277-283",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2009",
        "Author": "Srinivas Peeta; Yu-Ting Hsu",
        "Title": "Behavior modeling for dynamic routing under no-notice mass evacuation",
        "Short Title": "",
        "Publication Title": "Proceedings of the 12th International Conference on Travel Behaviour Research, Jaipur, India",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Due to the potential for large-scale loss of life and property under natural or man-made disasters, there is a need for effective mass evacuation mechanisms. From a transportation perspective, the mass evacuation problem entails the dynamic routing of the affected population to safe areas as soon as possible. A key aspect for the effective routing of evacuees is the need to robustly model human behavior. The resulting problem is complex because of the randomness associated with the disaster characteristics as well as human behavior under disaster scenarios. In this study, we propose a behavior model for dynamic routing that captures evacuees' response to the changing network conditions and the effect of traffic information and route guidance from emergency management agencies.Depending on the disaster characteristics, evacuation problems can be categorized into short-notice evacuation (hurricane …",
        "Date": "",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2019",
        "Author": "Po-An Chen; Hsuan-Ting Wu; Yu-Ting Hsu",
        "Title": "Widening narrow alleys to enhance response efficiency for fire emergency from the perspective of urban roadway network analysis",
        "Short Title": "",
        "Publication Title": "Journal of the Eastern Asia Society for Transportation Studies",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Narrow alleys serve as the key factor of fire safety in urban areas. Characterized by high population density and mixed land-use patterns, urban areas—particularly those old and decayed communities—in effect sustain higher fire risk. Moreover, narrow alleys that are impassable for fire engines delay the firefighting operations and rescue, resulting to great loss of life and property. In light of the frequent and repeated fire accidents due to such situation, this research seeks to address the issue of urban fire safety by considering measures to widen narrow alleys or designate emergency passages. Subsequently, the reduction of firefighting response time and the enhancement of overall area fire safety are analyzed. Most previous studies related to fire safety for narrow alleys focus on qualitative and policy-oriented discussions. By contrast, this research proposes a systematic approach that considers both the fire risk of communities/buildings and the current response practices to fire accidents in narrow alleys. An optimization model is developed on the basis of the network design problem, with the objectives to minimize the response time of firefighting operation and increase accessibility to fire scenes. Accordingly, this study aims to determine the narrow alleys of highest criticality and prioritize these areas for improvement (widening) projects. The modeling result and associated analysis are expected to become the reference for near-term or mid-term urban disaster management strategies, or even incorporated into the long-term planning of urban renewal.",
        "Date": "",
        "Pages": "2598-2613",
        "Issue": "",
        "Volume": "13",
        "Library Catalog": ""
    },
    {
        "Item Type": "report",
        "Publication Year": 2011,
        "Author": "Peeta, Srinivas; Sharma, Sushant; Hsu, Yu-Ting",
        "Title": "Dynamic Real-Time Routing for Evacuation Response Planning and Execution",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "https://doi.org/10.5703/1288284314621",
        "Url": "https://doi.org/10.5703/1288284314621",
        "Abstract Note": "",
        "Date": "2011-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2024,
        "Author": "Shih, Hsin-Cheng; Hsu, Yu-Ting; Lai, Yung-Cheng (Rex)",
        "Title": "Modeling non-compensatory strategies on path choices in a complex urban rail transit network considering characteristics of transfer passengers and trips",
        "Short Title": "",
        "Publication Title": "Travel Behaviour and Society",
        "DOI": "https://doi.org/10.1016/j.tbs.2023.100733",
        "Url": "https://doi.org/10.1016/j.tbs.2023.100733",
        "Abstract Note": "",
        "Date": "2024-04-01",
        "Pages": "100733",
        "Issue": "",
        "Volume": "35",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Shen, Chung-Wei; Mao, Mei-Neng; Hsu, Yu-Ting; Miralinaghi, Mohammad",
        "Title": "Research on Features of Pedestrians Using Smartphones at Transit Stations Based on Social Force Model",
        "Short Title": "",
        "Publication Title": "Transportation Research Record: Journal of the Transportation Research Board",
        "DOI": "https://doi.org/10.1177/03611981221090939",
        "Url": "https://doi.org/10.1177/03611981221090939",
        "Abstract Note": "<jats:p> The smartphone has become nearly indispensable in people’s daily lives. Prevalent smartphone usage can be observed on various occasions, even during walking. However, pedestrians’ perception of their surroundings may decline because they are absorbed by using the smartphone. The behavior of pedestrians using smartphones while walking at transit stations can be viewed as disturbance to pedestrian flows, thereby reducing the efficiency of station operation or even creating safety problems. This study seeks to describe such behavioral features mathematically and provide relevant implications for transit station design. Based on the social force model, the parameters reflecting the effect of smartphone usage on the perceived driving and repulsive forces are added and calibrated. By extracting trajectory data from the videos filmed in the field, the genetic algorithm is employed for the calibration process to minimize the gaps between the actual and projected trajectories. Two sets of parameter settings, for pedestrians with and without using smartphones, are determined and further applied to microscopic pedestrian simulation for a transfer station of the metro system in Taipei, Taiwan. The results indicate that pedestrians using smartphones are more prone to being affected by other pedestrians, revealing that their velocities are relatively unstable, while they need longer relaxation time to attain their desired walking statuses. The simulation results also visualize the potential bottlenecks in the station, where smartphone users may become obstacles to other pedestrians and increase the congestion level, highlighting the importance of incorporating the behavior modeling of pedestrians using smartphones into transit station design. </jats:p>",
        "Date": "2022-08-20",
        "Pages": "708-721",
        "Issue": "10",
        "Volume": "2676",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Su, Yu-Min; Chen, Jieh-Haur; Cheng, Jiun-Yao; Hsu, Yu-Ting; Huang, Ming-Cheng",
        "Title": "Rough-Set Based Association Rules toward Performance of High-Friction Road Markings",
        "Short Title": "",
        "Publication Title": "Journal of Transportation Engineering, Part B: Pavements",
        "DOI": "https://doi.org/10.1061/jpeodx.0000355",
        "Url": "https://doi.org/10.1061/jpeodx.0000355",
        "Abstract Note": "",
        "Date": "2022-06-01",
        "Pages": "",
        "Issue": "2",
        "Volume": "148",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2021",
        "Author": "Mei-Neng Mao; Ying-Chuan Ni; Yu-Ting Hsu",
        "Title": "Investigating Passengers’ Perspectives on Transfer Station Design of Urban Railway Systems: A Case Study in Taipei Metro",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "To enhance public transport attractiveness, it is critical for transit operators to provide convenient and user-friendly service for passengers. For urban railway systems, the efficiency and easiness of transfer between different lines can affect passengers’ satisfaction with overall system performance. Hence, transfer path design is an essential issue for the layout of transfer stations. This study identifies five categories of transfer patterns and thereupon seeks to explore factors influencing passengers’ perception of transfer experience on four facets: travel time, physical effort made, path complexity, and clarity of signage for guidance. For each facet, an ordered probit model is developed to factor the relative satisfaction level perceived by passengers based on the data collected from an attitudinal questionnaire survey is conducted over 17 transfer stations of Taipei metro system. The estimation results indicate that long travel time and excessive vertical movements along the transfer path can negatively affect passengers’ satisfaction. Specific transfer patterns, such as cross-platform transfer and out-of-station transfer, significantly influence passengers’ perception. Various types of signage also provide different levels of effectiveness in guiding transfer passengers. On the other hand, familiarity with the transfer station, riding frequency, and age are the individual attributes that can lead to different satisfaction levels. The derived research findings can provide relevant transit agencies a quantitative basis for improving the design of transfer station layouts and relevant facilities.",
        "Date": "",
        "Pages": "",
        "Issue": "TRBAM-21-01456",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2019",
        "Author": "Mohammad Miralinaghi; Sania E Seilabi; Sikai Chen; Yu-Ting Hsu; Samuel Labi",
        "Title": "Time-dependent traffic network design with multi-class projects",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The implementation of transportation infrastructure projects is often identified as one of the major causes of non-recurrent traffic congestion in urban areas. For this reason, decision-makers need to select and schedule these projects within a manner that minimizes traffic delay. This paper develops a general framework to simultaneously select and schedule construction projects subject to budget constraints over a given planning horizon. The project types considered in this paper include capacity expansion, new road construction and road rehabilitation. This paper formulates the selection and scheduling problem as a bi-level program where the decision-makers derive the optimal set of projects and the implementation schedules of these projects. In the lower level, travelers seek to minimize their travel times based on the decision of decision-makers in the upper level. The bi-level program is a mixed-integer program with complementarity constraints which is extremely difficult to solve. Therefore, this paper proposes an exact algorithm to efficiently solve the problem for large networks. The numerical experiments illustrate the importance of providing necessary funds earlier during the planning horizon to provide more flexibility for the transportation decision-maker in ultimately reducing traffic congestion.",
        "Date": "",
        "Pages": "",
        "Issue": "19-03832",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2017",
        "Author": "Dongyoon Song; Srinivas Peeta; Yu-Ting Hsu",
        "Title": "Psychological effects of real-time travel information on traveler route choice decision-making process",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Recent advances in information and mobile communications technologies, and the increasing use of smart devices, have altered how travelers use real-time travel information. More information is available from multiple sources, and information can also be tailored to individual needs. While such information can aid travelers to make more informed decisions, it may increase the complexity in information perception and decision-making process. In such a context, human factors-related aspects in perceiving real-time travel information and the consequent psychological effects of the perceived information play a significant role in traveler route choice decisions. This paper proposes a hybrid route choice model for the traveler route decision-making process under real-time information provision, in which latent variables are used to incorporate the psychological effects of information provision. These latent variables are obtained from a latent variable model that captures three psychological effects: cognitive burden, cognitive decisiveness, and emotional relief. Data on traveler behavior and information perception are obtained through interactive driving simulator-based experiments. Estimation results indicate that the inclusion of latent variables enhances the understanding of route decision-making process under information provision, especially in terms of the roles of human factors and multiple sources of information.",
        "Date": "",
        "Pages": "",
        "Issue": "17-01162",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2016,
        "Author": "Hsu, Yu‐Ting; Peeta, Srinivas",
        "Title": "Online calibration of an integrated framework for information‐based evacuation operations",
        "Short Title": "",
        "Publication Title": "Journal of Advanced Transportation",
        "DOI": "https://doi.org/10.1002/atr.1415",
        "Url": "https://doi.org/10.1002/atr.1415",
        "Abstract Note": "<jats:title>Summary</jats:title><jats:p>This study seeks to online calibrate the parameters of aggregate evacuee behavior models used in a behavior‐consistent information‐based control module for determining information strategies for real‐time evacuation operations. It enables the deployment of an operational framework for mass evacuation that integrates three aspects underlying an evacuation operation: demand (evacuee behavior), supply (network management), and disaster characteristics. To attain behavior‐consistency, the control module factors evacuees' likely responses to the disseminated information in determining information‐based control strategies. Hence, the ability of the behavior models to predict evacuees' likely responses is critical to the effectiveness of traffic routing by information strategies. The mixed logit structure is used for the aggregate behavior models to accommodate the behavioral heterogeneity across the population. An online calibration problem is proposed to calibrate the random parameters in the behavior models by using the least square estimator to minimize the gap between the predicted network flows and unfolding traffic dynamics. Background traffic, an important but rarely studied issue for modeling evacuation traffic, is also accounted for in the proposed problem. Numerical experiments are conducted to illustrate the importance of the calibration problem for addressing the system consistency issues and integrating the demand, supply, and disaster characteristics for more efficient evacuation operations. Copyright © 2016 John Wiley &amp; Sons, Ltd.</jats:p>",
        "Date": "2016-09-21",
        "Pages": "1531-1553",
        "Issue": "7",
        "Volume": "50",
        "Library Catalog": ""
    },
    {
        "Item Type": "bookChapter",
        "Publication Year": 2021,
        "Author": "Chen, Shi-Huang; Wang, Jin-Yuan; Hsu, Yu-Ting; Chen, Chi-Hwa; Chen, Chih-Yueh",
        "Title": "Development of a Vehicle Monitoring System for Low-Emission Zone Application Based on OBD Technology",
        "Short Title": "",
        "Publication Title": "Smart Innovation, Systems and Technologies",
        "DOI": "https://doi.org/10.1007/978-981-16-1209-1_19",
        "Url": "https://doi.org/10.1007/978-981-16-1209-1_19",
        "Abstract Note": "",
        "Date": "2021-01-01",
        "Pages": "205-211",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2017",
        "Author": "Yi-Hsuan Wu; Lei Kang; Po-Chieh Wang; Yu-Ting Hsu",
        "Title": "Exploratory Multivariate Analysis of Bike-Sharing System Use: Trip Characteristics and the Effect of Pricing Scheme Change",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Facing the rapidly growing popularity of bike-sharing systems worldwide, this study explores the trip characteristics of using public bikes at the level of zonal Origin-Destination (OD) pairs, particularly with respect to the effect of pricing scheme change. Based on the availability of transaction records of Youbike, the bike-sharing system in Taipei, Taiwan, which contain data before and after an increased usage fee (as the cancellation of a free-usage period for the first 30-minute), the associated demand-side responses are studied in the context of multivariate analysis. Two regressive models are developed thereupon to investigate the effect of the change on the O-D pairs associated various land-use patterns. A finite mixture model is constructed, which identifies three distinct components with different levels of sensitivity toward the changing price. An ordered probit model is further constructed for direct before-after analysis on the variation of zonal OD demand. Both models suggest that the pricing scheme change have greater impact on short-distance and student-related trips which are generally made by frequent users. Such research findings enable better understanding of the usage pattern of bike-sharing systems, which can benefit the associated planning and operation. They also imply the trade-off between the perspective of encouraging greener mobility and other managerial principles regarding public transportation and government subsidy.",
        "Date": "",
        "Pages": "",
        "Issue": "17-06683",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2013",
        "Author": "Yu-Ting Hsu",
        "Title": "A generalized operational framework for mass evacuation integrating demand, supply, and disaster characteristics",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "There has been an increasing focus in recent years on efficient response to large-scale disasters due to the severity of devastation under several natural and man-made disasters. From a transportation perspective, a key objective in this context is disaster-related mass evacuation to avoid/mitigate the potential loss of life. It addresses the movement of people (demand) from the region affected or threatened by a disaster to areas of safety using the available transportation system (supply). In an operational context, the mass evacuation problem is shaped by the dynamics of three underlying aspects: demand, supply, and disaster. Hence, it is critical to integrate the time-dependent effects, and consequent interactions, of these three aspects to determine effective evacuation strategies within a deployable framework. However, most current studies focus primarily on the supply-side management, while addressing the …",
        "Date": "",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2011",
        "Author": "Yu-Ting Hsu; Srinivas Peeta",
        "Title": "Behavior Modeling for Information-Based No-Notice Evacuation",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This paper proposes an aggregate approach to model evacuation behavior in the context of no-notice evacuation operations. The aggregate behavior models for evacuation decision and evacuation route choice are developed to support information-based control by a system controller for the dynamic routing of individuals during evacuation operations in a stage-based framework. The proposed models employ the mixed logit structure to account for heterogeneity across the affected population. In addition, due to the subjectivity involved in the perception and interpretation of the ambient environment and information received, relevant fuzzy logic variables are incorporated to capture these characteristics. Simulation experiments for a hypothetical terror attack are conducted to estimate and validate the model’s ability to capture the assumed evacuation-related behavior at an aggregate level. The results illustrate the …",
        "Date": "",
        "Pages": "",
        "Issue": "11-1051",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2025,
        "Author": "Yan, Shangyao; Sun, Ching-Sheng; Hsu, Yu-Ting",
        "Title": "Airport escort manpower supply planning and scheduling",
        "Short Title": "",
        "Publication Title": "Journal of Air Transport Management",
        "DOI": "https://doi.org/10.1016/j.jairtraman.2024.102735",
        "Url": "https://doi.org/10.1016/j.jairtraman.2024.102735",
        "Abstract Note": "",
        "Date": "2025-04-01",
        "Pages": "102735",
        "Issue": "",
        "Volume": "124",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2025,
        "Author": "Shih, Hsin-Cheng Ivan; Wijaya, Kenny Chandra; Hsueh, Hung-Yi; Hsu, Yu-Ting",
        "Title": "Away from over-populated development: Estimating urban carrying capacity with an integrated perspective of transportation and urban planning",
        "Short Title": "",
        "Publication Title": "Transport Policy",
        "DOI": "https://doi.org/10.1016/j.tranpol.2024.12.010",
        "Url": "https://doi.org/10.1016/j.tranpol.2024.12.010",
        "Abstract Note": "",
        "Date": "2025-03-01",
        "Pages": "283-295",
        "Issue": "",
        "Volume": "162",
        "Library Catalog": ""
    },
    {
        "Item Type": "bookChapter",
        "Publication Year": 2024,
        "Author": "Hsu, Yu-Ting; Wijaya, Kenny Chandra; Shih, Hsin-Cheng",
        "Title": "COVID-19 public transport responses in Taipei and Kaohsiung",
        "Short Title": "",
        "Publication Title": "International Perspectives on Public Transport Responses to COVID-19",
        "DOI": "https://doi.org/10.1016/b978-0-443-13295-7.00009-5",
        "Url": "https://doi.org/10.1016/b978-0-443-13295-7.00009-5",
        "Abstract Note": "",
        "Date": "2024-01-01",
        "Pages": "177-189",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2022",
        "Author": "Ruei-Yan CHANG; Katsuya SAKAI; Yu-Ting HSU",
        "Title": "Optimization of Dock Distribution in a Bike-Sharing System Considering Travelers’ Multi-Station Choices",
        "Short Title": "",
        "Publication Title": "Journal of the Eastern Asia Society for Transportation Studies",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Bike-Sharing Systems (BSSs) have become more and more prevalent around the world. The major problem of BSS operation is related to the spatiotemporally-varying usage pattern, which leads to the difficulty of resource allocation. In 2020, a dock-based BBS with lower construction cost was operating in Taiwan, which allow more flexible dock re-distribution/installation based on changes in usage. Thereby, denser stations hotspots/areas can be deployed for more convenient service. Particularly for the situation of no bike to rent at a station, users may be able to walk to a nearby station to access an available bike. This study incorporates such behavioral consideration into the problem of dock adjustment/re-allocation and develop a bi-level optimization model to determine the number of docks at each station for better response to demand variation and enhanced operational efficiency. A case study over a sample network is provided to verify the capability of the proposed model.",
        "Date": "",
        "Pages": "1553-1567",
        "Issue": "",
        "Volume": "14",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Sun, Min-Ci; Sakai, Katsuya; Chen, Albert Y.; Hsu, Yu-Ting",
        "Title": "Location Problems of In-Place Shelters for Dam-Failure Floods: Considering Vertical and Horizontal Evacuation",
        "Short Title": "",
        "Publication Title": "SSRN Electronic Journal",
        "DOI": "https://doi.org/10.2139/ssrn.3987794",
        "Url": "https://doi.org/10.2139/ssrn.3987794",
        "Abstract Note": "",
        "Date": "2021-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2020,
        "Author": "Lee, Wen-Yu; Hsu, Yu-Ting; Suen, Chian-Shan; Wu, Ming-Hsuan; Ni, Ying-Chuan",
        "Title": "Exploring Intercity Trip Patterns of Railway Systems on National Holidays Using Deep Auto-Encoder",
        "Short Title": "",
        "Publication Title": "Transportation Research Record: Journal of the Transportation Research Board",
        "DOI": "https://doi.org/10.1177/0361198120917385",
        "Url": "https://doi.org/10.1177/0361198120917385",
        "Abstract Note": "<jats:p> Intercity railway system operation on national holidays can be challenging because of possible surging demand. This study proposes an analysis framework to investigate railway system ridership data on national holidays, seeking to attain better understanding of relevant intercity trip patterns, so as to enable enhanced preparation and response before and during national holidays. The ridership data are analyzed in the form of Origin–Destination (O-D) tables and regarded as pictures of N ×  N pixels, where N is the number of the considered stations/cities in a railway system. The framework primarily adopts a deep auto-encoder to process these pictures to reduce data dimensions and abstracting key features within these pictorial data. Based on the abstracted features, k-means clustering is then conducted to categorize the O-D tables with similar trip patterns into the same group. Further, a discrete outcome model based on logistic regression is developed on the clustering results to enhance the interpretation of the trip pattern in each group and identify the significant holiday-related characteristics and external factors that can affect the trip pattern generation. The ridership data of Taiwan Railways Administration associated with 38 national holidays from January 2014 to August 2018 are analyzed. The analysis results highlight insightful interpretation in relation to clustered trip patterns and relevant trip characterization relative to various national holidays. The proposed framework and developed discrete outcome model are also validated, showing 85% correct assignments of O-D tables to the groups of relevant trip patterns. </jats:p>",
        "Date": "2020-05-01",
        "Pages": "662-672",
        "Issue": "5",
        "Volume": "2674",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2019",
        "Author": "Yu-Jen Chen; Yu-Ting Hsu; Mohammad Miralinaghi",
        "Title": "Optimizating Resilience of Restorating Disrupted Interdependent Infrastructure Systems",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study proposes the problem of scheduling the restoration for interdependent infrastructure systems after disaster impact, seeking to minimize the resilience loss throughout the horizon of a restoration plan. To solve the scheduling problem, the authors develop a mixed integer linear programming model, which applies the network flow method to describe the dynamics of commodity delivery, restoration units and functional states of components in the interdependent infrastructure systems, which contains roadway, electric power and telecommunication systems. To assess resilience loss in terms of system performance, they define the performance of each system based on the demand for the relevant service, and the objective function is defined to minimize the unmet demand throughout the recovery phase. This model also reflects the several types of interdependencies in the constraints. Primarily, the restoration interdependency is factored by using the network flow method to determine the connectivity of from restoration depots to the disrupted components of different systems in the roadway network, which can directly affect the feasibility of a restoration schedule. To exemplify the capability of the model, this study conducts numerical experiments using test networks of Tucheng District, New Taipei City, Taiwan and conceives three cases of different scales and patterns of disruption. In the numerical experiments, the cyber interdependency between the telecommunication and road networks is also discussed. The experiment results demonstrate that the proposed model can optimize restoration schedule based on the assessment of system …",
        "Date": "",
        "Pages": "",
        "Issue": "19-03331",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "proceedingsArticle",
        "Publication Year": 2018,
        "Author": "Chang, Tang-Hsien; Hsu, Yu-Ting; Wu, Kuan-Te",
        "Title": "Vehicular Ad-Hoc Network with a Multi-Hop Transmission Protocol",
        "Short Title": "",
        "Publication Title": "2018 11th International Symposium on Computational Intelligence and Design (ISCID)",
        "DOI": "https://doi.org/10.1109/iscid.2018.00084",
        "Url": "https://doi.org/10.1109/iscid.2018.00084",
        "Abstract Note": "",
        "Date": "2018-12-01",
        "Pages": "343-346",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2017",
        "Author": "Huai-Hsuan Huang; Yu-Ting Hsu; Mohammad Miralinaghi",
        "Title": "A Location Problem of Two-Level Disaster Relief Facilities for Vulnerable Networks",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "There has been increasing focus on disaster management and logistics due to the frequent occurrence of disasters, seeking to respond to disaster impact in a more effective manner in terms of delivering relief and rescue. Emergency response can be challenging for some vulnerable networks with low road density and subject to a high probability of being disconnected by disaster impact. Once some roads of such networks are damaged, it is likely that some locations or sub-areas will become isolated from outer supplies. This research formulates a location problem of disaster response facilities at two levels: disaster response centers and secondary facilities, self-sustainable relief stations. The former collects relief materials and re-distribute them to the affected areas; the latter ensures the self-sustainability of residents, even though they are isolated. The locations of the two facilities are interdependent based on the network structure and connectivity. Thereby, a bi-level programming approach is developed to integrate the determination of the locations at each level and address the complexity due to the interdependency. In addition, a heuristic algorithm to calculate connectivity reliabilities is developed with the correlation between the roads. Numerical experiments are made using the network of Nantou County in Taiwan, a mountainous county which is vulnerable to frequent landslides caused by earthquakes, hurricanes and heavy rainfalls. Experiment results show that the deployment of two-level disaster response facilities enables more efficient allocation of limited resources and reduce the expected number of unsupplied people during …",
        "Date": "",
        "Pages": "",
        "Issue": "17-06756",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2017",
        "Author": "Shu-Ting CHIEN; Yu-Ting HSU",
        "Title": "Research on Interactions between High-Speed Rail Facilities and Regional Development",
        "Short Title": "",
        "Publication Title": "Journal of the Eastern Asia Society for Transportation Studies",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This research seeks to explore the dynamics of spatiotemporal interactions between a high-speed rail project and the associated land-use patterns, particularly those surrounding stations, thereby providing insights into ridership forecasting and even regional development. Based on the case study, an integrated framework is proposed to analyze the dynamic process of transportation-land-use evolution involving spatiotemporal interactions in two stages, where a multiple linear regression model and a panel data analysis model are developed respectively. The process begins from the planning stage as the general public and investors may take certain actions in response to the development potential due to the expected mobility increase. Then throughout the entire project horizon, the key issues and specific development conditions that may be required to foster the process are identified. The research finding indicates that there are interactions between high-speed rail facilities and regional development.",
        "Date": "",
        "Pages": "784-803",
        "Issue": "",
        "Volume": "12",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2014",
        "Author": "Yu-Ting Hsu; Srinivas Peeta",
        "Title": "Clearance Time Estimation for Assessing Evacuation Risk in Real-Time Evacuation Operations",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study seeks to develop an efficient approach for estimating clearance time for evacuation operations, which will be used to assess evacuation risk. The approach needs to be computationally efficient for use in real-time evacuation operations, while being capable of approximating traffic flow dynamics reasonably. An approach based on the framework of dynamic network flow problems (DNFPs) which serve as intermediate tools between static and dynamic traffic routing approaches to leverage the trade-offs between traffic realism approximation and computational efficiency is approached. By analyzing the characteristics of evacuation networks, a dynamic routing policy labeled the demand-priority routing is proposed. It defines the priority of demand in using roadway capacity for evacuation based on the associated spatial risk due to the disaster; the demand with higher priority is recommended for evacuation …",
        "Date": "",
        "Pages": "",
        "Issue": "14-2730",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2014",
        "Author": "Yu-Ting Hsu; Srinivas Peeta",
        "Title": "Using Behavior-Consistent Information-Based Control for Traffic Routing in Real-Time Evacuation Operations",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The evacuation operations problem aims to avoid or mitigate the potential loss of life in a region threatened/affected by a disaster. It is shaped by the evolution of evacuation traffic resulting from the demand-supply interactions of the associated transportation network. Information-based control is a strategic tool for evacuation traffic operations as it can enable greater access to the affected population and more effective response. This study develops a control module for evacuation operations centered on addressing the demand-supply interactions by using behavior-consistent information strategies. These strategies incorporate the likely responses of evacuees to the information provided in the determination of route guidance information. The control module works as an iterative computational process involving an evacuee route choice model and a control model of information strategies to determine the route …",
        "Date": "",
        "Pages": "",
        "Issue": "14-2769",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": "2009",
        "Author": "Tang-Hsien Chang; Yu-Ting Hsu",
        "Title": "Dynamic Data Acquisition and Parameters Estimation for Traffic Prediction",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study proposes a real-time traffic data acquisition system and prediction algorithm. The framework of the system suggests taxi fleets as probe vehicles, combining roadside detectors to collect data from urban networks extensively. Then, mathematical models of “link travel time prediction” and “route flow estimation” are built based on generalized least squares and extended Kalman filter. To verify the prediction capability of the models, this study analyzed the results from grid network simulation. The models are proven well functioning with data processing and calibration. The mean errors of flow estimation on the generated network traffic flows are within 15%.",
        "Date": "",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Shih, Hsin-Cheng; Hsu, Yu-Ting; Lai, Yung-Cheng Rex",
        "Title": "Modeling Non-Compensatory Strategies on Path Choice Decisions in a Complex Metro Network Considering Characteristics of Transfer Passengers and Trips",
        "Short Title": "",
        "Publication Title": "SSRN Electronic Journal",
        "DOI": "https://doi.org/10.2139/ssrn.4310748",
        "Url": "https://doi.org/10.2139/ssrn.4310748",
        "Abstract Note": "",
        "Date": "2022-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "proceedingsArticle",
        "Publication Year": 2017,
        "Author": "Dai, Zhi-You; Kang, Jhihfu; Li, Ning; Yang, Likai; Hsu, Yu-Ting",
        "Title": "Partition Problem for Optimizing the Deployment of Incident Response",
        "Short Title": "",
        "Publication Title": "Computing in Civil Engineering 2017",
        "DOI": "https://doi.org/10.1061/9780784480823.054",
        "Url": "https://doi.org/10.1061/9780784480823.054",
        "Abstract Note": "",
        "Date": "2017-06-13",
        "Pages": "450-457",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    },
    {
        "Item Type": "proceedingsArticle",
        "Publication Year": 2017,
        "Author": "Hsu, Yu-Ting; Chen, Hsiang-Yin",
        "Title": "Formulating the Minimum Network Clearance Time for Evacuation Problems",
        "Short Title": "",
        "Publication Title": "Computing in Civil Engineering 2017",
        "DOI": "https://doi.org/10.1061/9780784480830.030",
        "Url": "https://doi.org/10.1061/9780784480830.030",
        "Abstract Note": "",
        "Date": "2017-06-13",
        "Pages": "238-245",
        "Issue": "",
        "Volume": "",
        "Library Catalog": ""
    }
]