[
    {
        "Item Type": "journalArticle",
        "Publication Year": 2025,
        "Author": "Shangyao Yan and Ching-Sheng Sun and Yu-Ting Hsu",
        "Title": "Airport escort manpower supply planning and scheduling",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Given the growing demand for tourism and an aging population, the need for escort services in airport operations is increasing steadily. Therefore, optimizing the dispatching of escorts to reduce waiting times for passengers with reduced mobility is currently a significant concern. This study utilizes the time-space network technique and mathematical programming to develop a model for escort manpower supply planning and scheduling, aiming to minimize manpower needs. Additionally, the model incorporates service delay and task aborting strategies to better reflect real-world scenarios. To efficiently solve the model, we introduce both a Relax-and-Fix algorithm and a fairness-considerate flow decomposition algorithm. Using data from a Taiwan international airport, we conduct a case study and perform sensitivity/scenario analysis on various parameters. The results highlight the potential of the developed model …",
        "Date": "2025-01-01",
        "Pages": "102735",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2025,
        "Author": "Hsin-Cheng Ivan Shih and Kenny Chandra Wijaya and Hung-Yi Hsueh and Yu-Ting Hsu",
        "Title": "Away from over-populated development: Estimating urban carrying capacity with an integrated perspective of transportation and urban planning",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Urban Carrying Capacity (UCC) is one of the most critical and essential attributes for urban planning. This study proposes a novel framework to estimate UCC from an integrated perspective of transportation and urban planning, which has never been discussed in the current body of UCC literature. By incorporating transportation planning (including O-D matrix estimation and traffic assignment) and urban planning (e.g., land use plan), the authority concerned can prevent the area from being overdeveloped, which may lead to unwanted situations such as traffic congestion and crowded streets that are the signs of low life quality and low urban efficiency. A case study for Shezidao, an area with a land development/readjustment plan in Taipei, is presented in this paper, and several scenario analyses are also carried out. This study derives several findings that support urban policymaking. For example, the results of the …",
        "Date": "2025-01-01",
        "Pages": "283-295",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2025,
        "Author": "Yu-Ting Hsu and Hsiang-Yin Chen",
        "Title": "Formulating the Minimum Network Clearance Time for Evacuation Problems",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Network clearance time is the time required to clear a network under evacuation; it can be interpreted as the time for the last person to leave the network for the place of safety as well. The minimization of network clearance time is a commonly used objective in evacuation problems, as it is critical when the surge of demand in a short period overwhelms the existing network capacity. However, it lacks mathematical formulation in contrast to other objectives, such as the minimization of total evacuation time (the system optimal flow) and maximization of arrivals to safe areas within a given time period (the earliest arrival flow). Hence, this study develops a dynamic programming approach to estimate network clearance time. Given the network structure and the distribution of evacuation demand, an algorithm is proposed to solve the evacuation problem backward from a super sink. The evacuation problem is decomposed …",
        "Date": "2025-03-09",
        "Pages": "238-245",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2025,
        "Author": "Hsin-Cheng Shih and Yu-Ting Hsu and Yung-Cheng Rex Lai",
        "Title": "Modeling Non-Compensatory Strategies on Path Choice Decisions in a Complex Metro Network Considering Characteristics of Transfer Passengers and Trips",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The path choice behavior of metro passengers is highly affected by transfer across different lines in a complex metro network that provides passengers with multiple path alternatives. Hence, the design of a transfer station in terms of its layout and transfer paths is gaining impact on passengers’ path choices in an expanding metro network. A comprehensive understanding of passenger behavior is essential for transportation planning and management to better design transfer stations and network operations. A questionnaire survey is conducted for passengers’ path choices and perception of transfer stations. Based on the collected data, this study develops a hybrid path choice model which combines Multinomial Logit Model (MNL) and Constrained Multinomial Logit Model (CMNL) to capture both compensatory and non-compensatory behavior. Further, a membership model is constructed to analyze the heterogeneity of passengers’ non-compensatory behavior on transfer walking time. Four segments are identified in regard to passenger and trip characteristics. The estimation results show that the proposed model outperforms the general MNL model and allows more convincing explanation of metro passenger behavior. Several research findings are derived, including that transfer walking time is more negatively perceived by passengers without non-compensatory behavior. Moreover, in-vehicle travel time is likely to be a minor consideration for passengers with non-compensatory behavior. The proposed model and framework enable metro operators and planners to retrieve more precise estimation of passenger flows and enhance service quality.",
        "Date": "2025-03-09",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2025,
        "Author": "Zhi-You Dai and Jhihfu Kang and Ning Li and Likai Yang and Yu-Ting Hsu",
        "Title": "Partition Problem for Optimizing the Deployment of Incident Response",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Incidents occurring on a freeway system can cause significant impact over traffic flows, such as long-duration and large-scale congestion and potential danger to the driving environment. Hence, prompt incident response is critical for freeway management. The objective of this study is to investigate the deployment of freeway incident response teams through the optimal partitioning of freeway segments, so as to attain the efficiency of dispatch and routing. Based on the analysis of historical incident data and response records, this study first visualizes the spatiotemporal pattern of incident occurrence over a GIS map. The factors that are significantly associated with the frequency of incident occurrence are further identified, and the possible causality is discussed thereupon. Considering the association and the structure of the freeway network, this study develops a partition problem, where each incident response team …",
        "Date": "2025-03-09",
        "Pages": "450-457",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2025,
        "Author": "Yu-Ting Hsu and Srinivas Peeta",
        "Title": "Word count: Words: 7076 Tables: 2 x 250= 500 Figures: 4 x 250= 1000",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This paper proposes an aggregate approach to model evacuation behavior in the context of no-notice evacuation operations. The aggregate behavior models for evacuation decision and evacuation route choice are developed to support information-based control by a system controller for the dynamic routing of individuals during evacuation operations in a stage-based framework. The proposed models employ the mixed logit structure to account for heterogeneity across the affected population. In addition, due to the subjectivity involved in the perception and interpretation of the ambient environment and information received, relevant fuzzy logic variables are incorporated to capture these characteristics. Simulation experiments for a hypothetical terror attack are conducted to estimate and validate the model’s ability to capture the assumed evacuation-related behavior at an aggregate level. The results illustrate the …",
        "Date": "2025-03-09",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2024,
        "Author": "Yu-Ting Hsu and Kenny Chandra Wijaya and Hsin-Cheng Shih",
        "Title": "COVID-19 public transport responses in Taipei and Kaohsiung",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Taiwan circumvented the first wave of COVID-19 impact in early 2020 owing to its experience with SARS in 2003. An agile response of border control and a series of rigorous preventive measures were implemented, receiving high acceptance and compliance from the people, who even spontaneously put on masks, thereby successfully containing the spread of the pandemic and maintaining a well-functioning society till mid-2021. The first outbreak of community-acquired infection in May 2021 severely impacted the ridership and operation of public transport in Taiwan. However, a relatively stronger recovery was observed compared with the cases in other cities. The second round of the outbreak on the island due to Omicron in April 2022, albeit, leading to a high infection rate, did not seriously affect people's lives as society was better protected with a high vaccination rate. This study also compares the cases of two …",
        "Date": "2024-01-01",
        "Pages": "177-189",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2024,
        "Author": "Hsin-Cheng Shih and Yu-Ting Hsu and Yung-Cheng Rex Lai",
        "Title": "Modeling non-compensatory strategies on path choices in a complex urban rail transit network considering characteristics of transfer passengers and trips",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The path choice behavior of passengers is highly affected by transfer across different lines in a complex urban rail transit network that provides passengers with multiple path alternatives. Hence, the design of a transfer station in terms of its layout and transfer paths is gaining impact on passengers’ path choices in an expanding urban rail transit network. A comprehensive understanding of passenger behavior is essential for transportation planning and management to better design transfer stations and network operations. A questionnaire survey is conducted for passengers’ path choices and perception of transfer stations. Based on the collected data, this study develops a joint path choice model that combines Multinomial Logit Model (MNL) and Constrained Multinomial Logit Model (CMNL) to capture both compensatory and non-compensatory behavior, especially the latter one, which has not been fully explored in …",
        "Date": "2024-01-01",
        "Pages": "100733",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Ying-Chuan Ni and Hsien-Hao Lo and Yu-Ting Hsu and Hung-Jen Huang",
        "Title": "Exploring the effects of passive transit signal priority design on bus rapid transit operation: A microsimulation-based optimization approach",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The Bus Rapid Transit (BRT) system can be a cost-effective alternative to foster public transportation. However, the delay in signalized intersections is critical to the stable progression of BRT operation. Transit Signal Priority (TSP) control has been studied to enhance the BRT operation. Nevertheless, the implementation of TSP may also impact general traffic and induce objection from the public. Upon this challenging aspect, this study focuses on passive TSP control for the BRT system. A microsimulation-based optimization model is developed to coordinate signal offsets along the arterial of BRT operation, seeking to minimize the delay of BRT vehicles without severely affecting the service level for other traffic. We conduct a case study over the Taichung BRT System in Taiwan; it indicates that the passive TSP control can reduce approximately 22% of transit delay while containing moderate impact on other traffic. In …",
        "Date": "2022-01-01",
        "Pages": "14-27",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Min-Ci Sun and Katsuya Sakai and Albert Y Chen and Yu-Ting Hsu",
        "Title": "Location problems of vertical evacuation structures for dam-failure floods: Considering shelter-in-place and horizontal evacuation",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The increasing threat of unpredictable and no-notice disasters due to climate change, such as tsunamis, wildfires, and dam-failure floods, should call for more attention to disaster management. These disasters leave limited time for the affected population to respond. Hence, Shelter-In-Place (SIP) strategies have been suggested to complement large-scale evacuation, aiming to secure individuals within local communities immediately. In the problem context of dam-failure floods, the priority of SIP is to elevate the individuals above the flooded ground, and Vertical Evacuation Structures/Shelters (VESs) are designed to contain these SIP evacuees. However, a portion of the flood-affected population cannot be accommodated because of the limited capacities of VESs. Accordingly, these evacuees must evacuate outside the flooded area, known as Horizontal Evacuation (HE). This study formulates the VES location …",
        "Date": "2022-01-01",
        "Pages": "103044",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Ruei-Yan CHANG and Katsuya SAKAI and Yu-Ting HSU",
        "Title": "Optimization of Dock Distribution in a Bike-Sharing System Considering Travelers’ Multi-Station Choices",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Bike-Sharing Systems (BSSs) have become more and more prevalent around the world. The major problem of BSS operation is related to the spatiotemporally-varying usage pattern, which leads to the difficulty of resource allocation. In 2020, a dock-based BBS with lower construction cost was operating in Taiwan, which allow more flexible dock re-distribution/installation based on changes in usage. Thereby, denser stations hotspots/areas can be deployed for more convenient service. Particularly for the situation of no bike to rent at a station, users may be able to walk to a nearby station to access an available bike. This study incorporates such behavioral consideration into the problem of dock adjustment/re-allocation and develop a bi-level optimization model to determine the number of docks at each station for better response to demand variation and enhanced operational efficiency. A case study over a sample network is provided to verify the capability of the proposed model.",
        "Date": "2022-01-01",
        "Pages": "1553-1567",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Chung-Wei Shen and Mei-Neng Mao and Yu-Ting Hsu and Mohammad Miralinaghi",
        "Title": "Research on features of pedestrians using smartphones at transit stations based on social force model",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The smartphone has become nearly indispensable in people’s daily lives. Prevalent smartphone usage can be observed on various occasions, even during walking. However, pedestrians’ perception of their surroundings may decline because they are absorbed by using the smartphone. The behavior of pedestrians using smartphones while walking at transit stations can be viewed as disturbance to pedestrian flows, thereby reducing the efficiency of station operation or even creating safety problems. This study seeks to describe such behavioral features mathematically and provide relevant implications for transit station design. Based on the social force model, the parameters reflecting the effect of smartphone usage on the perceived driving and repulsive forces are added and calibrated. By extracting trajectory data from the videos filmed in the field, the genetic algorithm is employed for the calibration process to …",
        "Date": "2022-01-01",
        "Pages": "708-721",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Chi-Ya Chou and Szu-Yun Lin and Cheng-Tao Yang and Yu-Ting Hsu",
        "Title": "Risk perception of earthquakes: Modeling conception of willingness to pay and prospect theory",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Natural disasters have greatly threatened people's lives and properties. In recent years, disaster management has become a key issue for the sustainable development of a society. In this regard, understanding how people perceive disasters is needed to formulate better disaster management strategies and enhance the resilience of the society. This research seeks to study risk perception and relevant attitudes, which are the fundamental factors of human behavior under the threat of disaster impact. A stated preference survey is conducted to investigate people's willingness to pay for earthquake risk reduction, where the effect of information is also the concern and incorporated in survey design. Thereupon, a multiple-bounded dichotomous choice model and an ordered probit model are estimated to quantify risk attitudes toward earthquakes as the monetary value. Results suggest that factors, such as higher …",
        "Date": "2022-01-01",
        "Pages": "103058",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2022,
        "Author": "Yu-Min Su and Jieh-Haur Chen and Jiun-Yao Cheng and Yu-Ting Hsu and Ming-Cheng Huang",
        "Title": "Rough-set based association rules toward performance of high-friction road markings",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The objective of this study was to explore the association rules influencing the frictional performance of high-friction road markings based on the skid resistance acceptance standard in excess of 65 British Pendulum Number (BPN). The paper integrates two widely used data mining approaches, rough set theory (RST) and the association rule algorithm, to extract the association rules. Three workshops with 14 experts and two on-site surveys were conducted, followed by collecting 303 field data sets based on British Pendulum Test method and ASTM E303-93 test standard. There are nine important attributes extracted and two of them are the core attributes: distance from margin and surface temperature. The 13 rules regarding the consequences of BPN  and BPN  indicate that surface age is vital in the skid resistance performance of road markings because it appears in every rule. There is more likely to be a …",
        "Date": "2022-01-01",
        "Pages": "05022001",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Po-Chieh Wang and Yu-Ting Hsu and Chia-Wei Hsu",
        "Title": "Analysis of waiting time perception of bus passengers provided with mobile service",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Smartphones and relevant mobile service have greatly influenced people’s daily lives, and intense smartphone users can be commonly seen at transit stops/stations, playing with their smartphones while waiting for buses/trains. This research presents a holistic perspective for analyzing the effects of smartphone usage on transit passengers, which also considers the effects at a psychological level. Such effects may be manifested as the reduction of perceived waiting time at stops/stations against the negative emotionality induced by long waiting, such as boredom and tediousness, so as to result in improved travel experience. An on-site survey is designed and implemented over the bus system in Taipei, Taiwan, to collect the revealed responses of bus passengers in regard to waiting time perception and smartphone usage, particularly for travel-irrelevant mobile service. The survey data are modeled and analyzed in …",
        "Date": "2021-01-01",
        "Pages": "319-336",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Shi-Huang Chen and Jin-Yuan Wang and Yu-Ting Hsu and Chi-Hwa Chen and Chih-Yueh Chen",
        "Title": "Development of a Vehicle Monitoring System for Low-Emission Zone Application Based on OBD Technology",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This paper proposed a vehicle monitoring system for low-emission zone application based on OBD (on-board diagnostics) technology. The proposed system is composed of OBD, GPS, 4G mobile communication, and Internet cloud computing technologies. The proposed system could implement in real time the function of vehicle status surveillance and could be applied to low-emission zone (LEZ) application. The monitored features cover vehicle identification number (VIN), malfunction indicator lamp (MIL) status, and number of diagnostic trouble codes (DTCs). These vehicle information, i.e., VIN, MIL, and DTC, as well as GPS data will be sent to the Internet cloud computing server using 4G mobile network for LEZ application. Once the system discovers the vehicle does not meet the LEZ standards and drives into LEZ, the proposed system could inform the user and management department to deal with this …",
        "Date": "2021-01-01",
        "Pages": "205-211",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Mei-Neng Mao and Ying-Chuan Ni and Yu-Ting Hsu",
        "Title": "Investigating Passengers’ Perspectives on Transfer Station Design of Urban Railway Systems: A Case Study in Taipei Metro",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "To enhance public transport attractiveness, it is critical for transit operators to provide convenient and user-friendly service for passengers. For urban railway systems, the efficiency and easiness of transfer between different lines can affect passengers’ satisfaction with overall system performance. Hence, transfer path design is an essential issue for the layout of transfer stations. This study identifies five categories of transfer patterns and thereupon seeks to explore factors influencing passengers’ perception of transfer experience on four facets: travel time, physical effort made, path complexity, and clarity of signage for guidance. For each facet, an ordered probit model is developed to factor the relative satisfaction level perceived by passengers based on the data collected from an attitudinal questionnaire survey is conducted over 17 transfer stations of Taipei metro system. The estimation results indicate that long travel time and excessive vertical movements along the transfer path can negatively affect passengers’ satisfaction. Specific transfer patterns, such as cross-platform transfer and out-of-station transfer, significantly influence passengers’ perception. Various types of signage also provide different levels of effectiveness in guiding transfer passengers. On the other hand, familiarity with the transfer station, riding frequency, and age are the individual attributes that can lead to different satisfaction levels. The derived research findings can provide relevant transit agencies a quantitative basis for improving the design of transfer station layouts and relevant facilities.",
        "Date": "2021-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Min-Ci Sun and Katsuya Sakai and Albert Y Chen and Yu-Ting Hsu",
        "Title": "Location Problems of In-Place Shelters for Dam-Failure Floods: Considering Vertical and Horizontal Evacuation",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The increasing threat of unpredictable and no-notice disasters due to climate change, such as tsunami, wildfires, and dam-failure floods, should call for more attention to disaster management. These disasters leave limited time for the affected population to respond. Hence, Shelter-In-Place (SIP) strategies have been suggested to complement large-scale evacuation, aiming to secure individuals within local communities immediately. In the problem context of dam-failure floods, the priority of SIP is to elevate the individuals above the flooded ground, known as Vertical Evacuation (VE). Vertical Evacuation Structures/Shelters (VESs) are designed to contain these SIP evacuees. However, a portion of the flood-affected population cannot be accommodated because of the limited capacities of VESs. Accordingly, these evacuees must evacuate outside the flooded area, known as Horizontal Evacuation (HE). This study formulates the VES location problem considering VE and HE: the established VESs will cover as many evacuees as possible and reduce the system evacuation time for HE. The VES locations and the HE evacuee assignment are interdependent, as reflected by factoring individual evacuation time. Therefore, this study develops a bi-level programming model to address the interdependence. Furthermore, a heuristic algorithm is proposed to analyze the evacuation time for evacuees at each node. The bi-level model is verified using the network of Tucheng District, New Taipei City, Taiwan, impacted by dam-failure floods. Results show that the total evacuation time can be reduced significantly by integrating HE into VES planning.",
        "Date": "2021-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Chun-Chien Hsiao and Min-Ci Sun and Albert Y Chen and Yu-Ting Hsu",
        "Title": "Location problems for shelter-in-place deployment: A case study of vertical evacuation upon dam-break floods",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Unpredictable and no-notice disasters such as flash floods and wildfires, have been increasing. Under such circumstances, large-scale evacuation is required and the population may not be able to be effectively relocated in time from the disaster-threatened zone. The evacuees may be risking their lives during evacuation traveling toward the designated shelters/safety zones. A Shelter-In-Place (SIP) strategy is proposed to provide immediate avoidance of hazards for communities. This study develops the optimization models to determine SIP deployment and evacuee assignment for the case of vertical evacuation (VE) in response to dam-break floods. Compared with general shelters located outside evacuation areas, SIPs are designed to be reachable on foot upon the occurrence of sudden disasters. Accessibility of SIPs is one of the primary concerns in the problem context of determining their locations. Multi-class …",
        "Date": "2021-01-01",
        "Pages": "102048",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2021,
        "Author": "Yu-Ting Hsu and Shangyao Yan and Powei Huang",
        "Title": "The depot and charging facility location problem for electrifying urban bus services",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The transition from diesel-consuming buses to electric ones entails the problem of determining the locations of bus depots, charging and maintenance stations, which can directly affect the operating cost and efficiency of a bus system. The problem also involves practical concerns, including the selection of fleet size (of electric buses), land acquisition, bus allocation, and the associated deadhead mileage. This study develops an optimization model to systematically locate depots and relevant facilities for deploying mixed types of vehicles. Further, a decomposition-based heuristic algorithm is proposed to enhance computational efficiency. A case study is performed using the data of a bus operator in Taiwan. Sensitivity and scenario analyses are conducted, evaluating major cost components and identifying the factors that affect the trade-offs between them. The proposed methodology enables bus operators/planners …",
        "Date": "2021-01-01",
        "Pages": "103053",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2020,
        "Author": "Wen-Yu Lee and Yu-Ting Hsu and Chian-Shan Suen and Ming-Hsuan Wu and Ying-Chuan Ni",
        "Title": "Exploring Intercity Trip Patterns of Railway Systems on National Holidays Using Deep Auto-Encoder",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Intercity railway system operation on national holidays can be challenging because of possible surging demand. This study proposes an analysis framework to investigate railway system ridership data on national holidays, seeking to attain better understanding of relevant intercity trip patterns, so as to enable enhanced preparation and response before and during national holidays. The ridership data are analyzed in the form of Origin–Destination (O-D) tables and regarded as pictures of N × N pixels, where N is the number of the considered stations/cities in a railway system. The framework primarily adopts a deep auto-encoder to process these pictures to reduce data dimensions and abstracting key features within these pictorial data. Based on the abstracted features, k-means clustering is then conducted to categorize the O-D tables with similar trip patterns into the same group. Further, a discrete outcome …",
        "Date": "2020-01-01",
        "Pages": "662-672",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2020,
        "Author": "Mohammad Miralinaghi and Sania E Seilabi and Sikai Chen and Yu-Ting Hsu and Samuel Labi",
        "Title": "Optimizing the selection and scheduling of multi-class projects using a Stackelberg framework",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "One of the major causes of non-recurrent traffic congestion in urban areas is the implementation of transport infrastructure projects on city roads. The seeming ubiquity of work zones in cities causes road user frustration and safety hazards, and public relations problems for the transport agency. For this reason, transport agencies seek strategic ways to not only select urban projects but also schedule them in a manner that minimizes the effort associated with these functions. In other words, they seek to exploit the synergies between the tasks of project selection and project scheduling while duly accommodating the project interdependencies. This study introduces a general framework that simultaneously and optimally selects and schedules urban road projects subject to budgetary constraints over a given planning horizon. The project classes considered in this study are lane addition, new road construction, and road …",
        "Date": "2020-01-01",
        "Pages": "508-522",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2019,
        "Author": "Yi-Hsuan Wu and Lei Kang and Yu-Ting Hsu and Po-Chieh Wang",
        "Title": "Exploring trip characteristics of bike-sharing system uses: Effects of land-use patterns and pricing scheme change",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Facing the rapidly growing popularity of bike-sharing systems worldwide, this study explores the trip characteristics of using public bikes at the level of zonal Origin-Destination (O-D) pairs, particularly with respect to the effect of pricing scheme change. Based on the transaction records of Youbike, a bike-sharing system in Taipei, Taiwan, which contain data before and after an increase of the rental fee (as the cancellation of a free-usage period for the first 30-minute), the associated demand-side responses are studied in the context of multivariate analysis. Two regression models are developed thereupon to investigate the effect of the change on the O-D demand associated various land-use patterns. A multiple linear regression model is developed for direct before-after analysis on the variation of zonal O-D demand. A finite mixture model is further constructed, which identifies three usage groups with different levels …",
        "Date": "2019-01-01",
        "Pages": "318-331",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2019,
        "Author": "James C Chu and Kanticha Korsesthakarn and Yu-Ting Hsu and Hua-Yen Wu",
        "Title": "Models and a solution algorithm for planning transfer synchronization of bus timetables",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Mixed-integer linear programming models and a heuristic algorithm are proposed for the transfer synchronization planning of bus timetables. The most important novelty of the proposed methodology is that the bus timetables and passenger choices of travel paths are simultaneously optimized in the model. The possibilities of transfer synchronization are fully explored in the timetable optimization because passengers select their paths to the destination in response to the timetables. Hence, bus timetables can be planned with high precision, and bus timetabling can be improved.",
        "Date": "2019-01-01",
        "Pages": "247-266",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2019,
        "Author": "Yu-Jen Chen and Yu-Ting Hsu and Mohammad Miralinaghi",
        "Title": "Optimizating Resilience of Restorating Disrupted Interdependent Infrastructure Systems",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study proposes the problem of scheduling the restoration for interdependent infrastructure systems after disaster impact, seeking to minimize the resilience loss throughout the horizon of a restoration plan. To solve the scheduling problem, the authors develop a mixed integer linear programming model, which applies the network flow method to describe the dynamics of commodity delivery, restoration units and functional states of components in the interdependent infrastructure systems, which contains roadway, electric power and telecommunication systems. To assess resilience loss in terms of system performance, they define the performance of each system based on the demand for the relevant service, and the objective function is defined to minimize the unmet demand throughout the recovery phase. This model also reflects the several types of interdependencies in the constraints. Primarily, the restoration interdependency is factored by using the network flow method to determine the connectivity of from restoration depots to the disrupted components of different systems in the roadway network, which can directly affect the feasibility of a restoration schedule. To exemplify the capability of the model, this study conducts numerical experiments using test networks of Tucheng District, New Taipei City, Taiwan and conceives three cases of different scales and patterns of disruption. In the numerical experiments, the cyber interdependency between the telecommunication and road networks is also discussed. The experiment results demonstrate that the proposed model can optimize restoration schedule based on the assessment of system …",
        "Date": "2019-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2019,
        "Author": "Mohammad Miralinaghi and Sania E Seilabi and Sikai Chen and Yu-Ting Hsu and Samuel Labi",
        "Title": "Time-dependent traffic network design with multi-class projects",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The implementation of transportation infrastructure projects is often identified as one of the major causes of non-recurrent traffic congestion in urban areas. For this reason, decision-makers need to select and schedule these projects within a manner that minimizes traffic delay. This paper develops a general framework to simultaneously select and schedule construction projects subject to budget constraints over a given planning horizon. The project types considered in this paper include capacity expansion, new road construction and road rehabilitation. This paper formulates the selection and scheduling problem as a bi-level program where the decision-makers derive the optimal set of projects and the implementation schedules of these projects. In the lower level, travelers seek to minimize their travel times based on the decision of decision-makers in the upper level. The bi-level program is a mixed-integer program with complementarity constraints which is extremely difficult to solve. Therefore, this paper proposes an exact algorithm to efficiently solve the problem for large networks. The numerical experiments illustrate the importance of providing necessary funds earlier during the planning horizon to provide more flexibility for the transportation decision-maker in ultimately reducing traffic congestion.",
        "Date": "2019-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2019,
        "Author": "Po-An Chen and Hsuan-Ting Wu and Yu-Ting Hsu",
        "Title": "Widening narrow alleys to enhance response efficiency for fire emergency from the perspective of urban roadway network analysis",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Narrow alleys serve as the key factor of fire safety in urban areas. Characterized by high population density and mixed land-use patterns, urban areas—particularly those old and decayed communities—in effect sustain higher fire risk. Moreover, narrow alleys that are impassable for fire engines delay the firefighting operations and rescue, resulting to great loss of life and property. In light of the frequent and repeated fire accidents due to such situation, this research seeks to address the issue of urban fire safety by considering measures to widen narrow alleys or designate emergency passages. Subsequently, the reduction of firefighting response time and the enhancement of overall area fire safety are analyzed. Most previous studies related to fire safety for narrow alleys focus on qualitative and policy-oriented discussions. By contrast, this research proposes a systematic approach that considers both the fire risk of communities/buildings and the current response practices to fire accidents in narrow alleys. An optimization model is developed on the basis of the network design problem, with the objectives to minimize the response time of firefighting operation and increase accessibility to fire scenes. Accordingly, this study aims to determine the narrow alleys of highest criticality and prioritize these areas for improvement (widening) projects. The modeling result and associated analysis are expected to become the reference for near-term or mid-term urban disaster management strategies, or even incorporated into the long-term planning of urban renewal.",
        "Date": "2019-01-01",
        "Pages": "2598-2613",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2018,
        "Author": "Tang-Hsien Chang and Jen-Sung Tseng and Tung-Hung Hsieh and Yu-Ting Hsu and Ying-Chih Lu",
        "Title": "Green transportation implementation through distance-based road pricing",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The implementation of electronic toll collection (ETC) over freeways not only enables nonstop traffic flows through toll collection zones but also facilitates more flexible schemes for road pricing, such as distance-based and time-based schemes, as both the on-ramp and off-ramp time stamps of a trip can be detected. Based on such an ETC environment, this study develops a road pricing model which considers the perspectives of road users, the government, and the ETC agent, seeking to attain greener transportation by leveraging the external costs related to environmental impact and accident potential. Thereupon, a Green Safety Indicator (GSI) is proposed to comprehensively account for the service level of freeway traffic. The optimal solution for the benefits generated from three scenarios are determined against GSI-based equilibria, which can maintain the revenue for the government, offer the ETC agent higher …",
        "Date": "2018-01-01",
        "Pages": "53-64",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2018,
        "Author": "Tang-Hsien Chang and Yu-Ting Hsu and Kuan-Te Wu",
        "Title": "Vehicular Ad-Hoc Network with a Multi-Hop Transmission Protocol",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Vehicular Ad Hoc Network (VANET), containing access points free for wireless transmission, is now developed for V2V and V2I communication, in order to improve traffic safety, provide services and further support the implementation of the automated driving mode. However, the most important issue is how to develop an efficient VANET protocol, particularly corresponding to reduce transmission latency when routing. This paper proposes a novel multi-hop routing algorithm to accomplish message transmission via the nodes participating in the given vehicular ad-hoc network. According to the testing result, the proposed protocol is acceptable.",
        "Date": "2018-01-01",
        "Pages": "343-346",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2017,
        "Author": "Huai-Hsuan Huang and Yu-Ting Hsu and Mohammad Miralinaghi",
        "Title": "A Location Problem of Two-Level Disaster Relief Facilities for Vulnerable Networks",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "There has been increasing focus on disaster management and logistics due to the frequent occurrence of disasters, seeking to respond to disaster impact in a more effective manner in terms of delivering relief and rescue. Emergency response can be challenging for some vulnerable networks with low road density and subject to a high probability of being disconnected by disaster impact. Once some roads of such networks are damaged, it is likely that some locations or sub-areas will become isolated from outer supplies. This research formulates a location problem of disaster response facilities at two levels: disaster response centers and secondary facilities, self-sustainable relief stations. The former collects relief materials and re-distribute them to the affected areas; the latter ensures the self-sustainability of residents, even though they are isolated. The locations of the two facilities are interdependent based on the network structure and connectivity. Thereby, a bi-level programming approach is developed to integrate the determination of the locations at each level and address the complexity due to the interdependency. In addition, a heuristic algorithm to calculate connectivity reliabilities is developed with the correlation between the roads. Numerical experiments are made using the network of Nantou County in Taiwan, a mountainous county which is vulnerable to frequent landslides caused by earthquakes, hurricanes and heavy rainfalls. Experiment results show that the deployment of two-level disaster response facilities enables more efficient allocation of limited resources and reduce the expected number of unsupplied people during …",
        "Date": "2017-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2017,
        "Author": "Yi-Hsuan Wu and Lei Kang and Po-Chieh Wang and Yu-Ting Hsu",
        "Title": "Exploratory Multivariate Analysis of Bike-Sharing System Use: Trip Characteristics and the Effect of Pricing Scheme Change",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Facing the rapidly growing popularity of bike-sharing systems worldwide, this study explores the trip characteristics of using public bikes at the level of zonal Origin-Destination (OD) pairs, particularly with respect to the effect of pricing scheme change. Based on the availability of transaction records of Youbike, the bike-sharing system in Taipei, Taiwan, which contain data before and after an increased usage fee (as the cancellation of a free-usage period for the first 30-minute), the associated demand-side responses are studied in the context of multivariate analysis. Two regressive models are developed thereupon to investigate the effect of the change on the O-D pairs associated various land-use patterns. A finite mixture model is constructed, which identifies three distinct components with different levels of sensitivity toward the changing price. An ordered probit model is further constructed for direct before-after analysis on the variation of zonal OD demand. Both models suggest that the pricing scheme change have greater impact on short-distance and student-related trips which are generally made by frequent users. Such research findings enable better understanding of the usage pattern of bike-sharing systems, which can benefit the associated planning and operation. They also imply the trade-off between the perspective of encouraging greener mobility and other managerial principles regarding public transportation and government subsidy.",
        "Date": "2017-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2017,
        "Author": "Dongyoon Song and Srinivas Peeta and Yu-Ting Hsu",
        "Title": "Psychological effects of real-time travel information on traveler route choice decision-making process",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Recent advances in information and mobile communications technologies, and the increasing use of smart devices, have altered how travelers use real-time travel information. More information is available from multiple sources, and information can also be tailored to individual needs. While such information can aid travelers to make more informed decisions, it may increase the complexity in information perception and decision-making process. In such a context, human factors-related aspects in perceiving real-time travel information and the consequent psychological effects of the perceived information play a significant role in traveler route choice decisions. This paper proposes a hybrid route choice model for the traveler route decision-making process under real-time information provision, in which latent variables are used to incorporate the psychological effects of information provision. These latent variables are obtained from a latent variable model that captures three psychological effects: cognitive burden, cognitive decisiveness, and emotional relief. Data on traveler behavior and information perception are obtained through interactive driving simulator-based experiments. Estimation results indicate that the inclusion of latent variables enhances the understanding of route decision-making process under information provision, especially in terms of the roles of human factors and multiple sources of information.",
        "Date": "2017-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2017,
        "Author": "Shu-Ting CHIEN and Yu-Ting HSU",
        "Title": "Research on Interactions between High-Speed Rail Facilities and Regional Development",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This research seeks to explore the dynamics of spatiotemporal interactions between a high-speed rail project and the associated land-use patterns, particularly those surrounding stations, thereby providing insights into ridership forecasting and even regional development. Based on the case study, an integrated framework is proposed to analyze the dynamic process of transportation-land-use evolution involving spatiotemporal interactions in two stages, where a multiple linear regression model and a panel data analysis model are developed respectively. The process begins from the planning stage as the general public and investors may take certain actions in response to the development potential due to the expected mobility increase. Then throughout the entire project horizon, the key issues and specific development conditions that may be required to foster the process are identified. The research finding indicates that there are interactions between high-speed rail facilities and regional development.",
        "Date": "2017-01-01",
        "Pages": "784-803",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2017,
        "Author": "Dongyoon Song and Srinivas Peeta and Yu-ting Hsu and Shubham Agrawal",
        "Title": "Role of psychological effects of real-time travel information provision on en route traveler route choice decisions",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "While real-time travel information can aid travelers to make informed decisions, it may increase the cognitive load in information perception and the complexity in decision-making process, especially when the information is from multiple sources. Under this circumstance, human factors-related aspects in information perception and the consequent psychological effects of the information play significant roles in traveler route choice decision-making. This study proposes a hybrid route choice model under the presence of real-time travel information, in which latent variables are employed to represent the psychological effects of information provision. Three dimensions of psychological effects–cognitive burden, cognitive decisiveness, and emotional relief–are assumed as latent psychological constructs in the proposed model. Data on traveler behavior and information perception are obtained through interactive driving simulator-based experiments. Estimation results will verify that the inclusion of the latent variables enhances the understanding of route choice decision-making under information provision.",
        "Date": "2017-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2016,
        "Author": "Tang-Hsien Chang and Albert Y Chen and Yu-Ting Hsu and Chien-Li Yang",
        "Title": "Freeway travel time prediction based on seamless spatio-temporal data fusion: Case study of the freeway in Taiwan",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Travel time prediction has been the fundamental brick for developing both Advanced Traffic Management Systems (ATMS) and Advanced Traveler Information Systems (ATIS). The problem of travel time prediction is primarily shaped by the data available for model development and the needs from the perspectives of both travelers and operators. A distance-based Electronic Toll Collection (ETC) system over the freeway system in Taiwan has been fully implemented since December 2013, which provides more comprehensive online data acquisition of freeway traffic conditions, thereby enabling the capability to more reliably predict of travel time over freeway segments. Based on the data from both the ETC system and traditional Vehicle Detectors (VDs), this research proposes a travel time prediction approach whose core technique of data fusion seeks to seamlessly capture the spatio-temporal pattern of freeway …",
        "Date": "2016-01-01",
        "Pages": "452-459",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2016,
        "Author": "Mohammad Miralinaghi and Yingyan Lou and Yu‐Ting Hsu and Ramin Shabanpour and Yousef Shafahi",
        "Title": "Multiclass fuzzy user equilibrium with endogenous membership functions and risk‐taking behaviors",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Over the last decades, several approaches have been proposed in the literature to incorporate users' perceptions of travel costs, their bounded rationality, and risk‐taking behaviors into network equilibrium modeling for traffic assignment problem. While theoretically advanced, these models often suffer from high complexity and computational cost and often involve parameters that are difficult to estimate. This study proposes an alternative approach where users' imprecise perceptions of travel times are endogenously constructed as fuzzy sets based on the probability distributions of random link travel times. Two decision rules are proposed accordingly to account for users' heterogeneous risk‐taking behaviors, that is, optimistic and pessimistic rules. The proposed approach, namely, the multiclass fuzzy user equilibrium, can be formulated as a link‐based variational inequality model. The model can be solved …",
        "Date": "2016-01-01",
        "Pages": "1716-1734",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2016,
        "Author": "Yu‐Ting Hsu and Srinivas Peeta",
        "Title": "Online calibration of an integrated framework for information‐based evacuation operations",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study seeks to online calibrate the parameters of aggregate evacuee behavior models used in a behavior‐consistent information‐based control module for determining information strategies for real‐time evacuation operations. It enables the deployment of an operational framework for mass evacuation that integrates three aspects underlying an evacuation operation: demand (evacuee behavior), supply (network management), and disaster characteristics. To attain behavior‐consistency, the control module factors evacuees' likely responses to the disseminated information in determining information‐based control strategies. Hence, the ability of the behavior models to predict evacuees' likely responses is critical to the effectiveness of traffic routing by information strategies. The mixed logit structure is used for the aggregate behavior models to accommodate the behavioral heterogeneity across the population …",
        "Date": "2016-01-01",
        "Pages": "1531-1553",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2016,
        "Author": "Yu-Ting Hsu and Lei Kang and Yi-Hsuan Wu",
        "Title": "User behavior of bikesharing systems under demand–supply imbalance",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Bikesharing systems have been expanding rapidly. They are recognized as a strategic tool to integrate transit and to foster sustainable transportation in urban areas. A critical problem that arises in the planning and deployment of a bikesharing system lies in demand–supply imbalance as the result of the spatiotemporal dynamics of demand patterns. The problem manifests itself in situations in which no bikes are available to rent and no docks are available for bike return at certain popular stations. This study developed a framework for modeling user behavior in response to such situations. Particular emphasis was placed on user on-site choice behavior and the behavioral aspect related to wait time if a decision to wait for the next bike or dock was made. These behaviors were approached with the use of a discrete choice model and a duration model, respectively. Further, a discrete-continuous process was …",
        "Date": "2016-01-01",
        "Pages": "117-124",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2015,
        "Author": "Yu-Ting Hsu and Srinivas Peeta",
        "Title": "Clearance time estimation for incorporating evacuation risk in routing strategies for evacuation operations",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study seeks to develop an approximate but efficient approach for estimating evacuation clearance time which is defined as the time required to evacuate the population of a location to areas of safety. Elsewhere, this estimate of the clearance time is used as input to infer evacuation risk for a location which reflects whether the population of that location can be safely evacuated before the disaster impacts it. As the computed evacuation risk is used in a real-time stage-based framework for evacuation operations, the approach for clearance time estimation needs to be computationally efficient while being capable of approximating traffic flow dynamics reasonably. To address these needs, a dynamic routing policy labeled the location-priority routing is proposed, and the associated clearance time estimation problem is formulated as a dynamic network flow problem. The location-priority is based on the lead …",
        "Date": "2015-01-01",
        "Pages": "743-764",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2015,
        "Author": "Yu-Ting Hsu and Wei-Ren Lin and Yung-Cheng Rex Lai and TCT Kao",
        "Title": "Forecasting High-speed Rail Ridership Using Aggregate Data: A case Revisit of High speed rail in Taiwan",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Forecasting High Speed Rail Ridership Using Aggregate Data: Page 1 Yu-Ting Hsu, Wei-Ren \nLin, Yung-Cheng (Rex) Lai, and Tsung-Chung (TC) Kao Forecasting High Speed Rail \nRidership Using Aggregate Data: A Case Revisit of High Speed Rail in Taiwan Transportation \nResearch Board 2015, Washington DC Department of Civil Engineering, National Taiwan \nUniversity Railroad Transportation & Engineering Center (RailTEC) Page 2 Background 2 ► \nHigh Speed Rail (HSR) to address continuously increasing global vehicular demand ► The \ntrend of HSR development - Looking backward to the past 50 years First HSR system: \nShinkansen between Tokyo and Osaka in 1964 - Recent trend (by November 2013) • 21,472 \nkm of HSR lines in operation • 13,964 km under construction (70% in developing countries) • \n16,347 km planned Page 3 Background: The Challenges 3 ► Failure of ridership forecasting (…",
        "Date": "2015-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2014,
        "Author": "Yu-Ting Hsu and Srinivas Peeta",
        "Title": "Behavior-consistent information-based network traffic control for evacuation operations",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The evacuation operations problem aims to avoid or mitigate the potential loss of life in a region threatened or affected by a disaster. It is shaped to a large extent by the evolution of evacuation traffic resulting from the demand–supply interactions of the associated transportation network. Information-based control is a strategic tool for evacuation traffic operations as it can enable greater access to the affected population and more effective response. However, comparatively few studies have focused on the implementation of information-based control in evacuation operations. This study develops a control module for evacuation operations centered on addressing the demand–supply interactions by using behavior-consistent information strategies. These strategies incorporate the likely responses of evacuees to the information provided in the determination of route guidance information. The control module works as …",
        "Date": "2014-01-01",
        "Pages": "339-359",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2014,
        "Author": "Yu-Ting Hsu and Srinivas Peeta",
        "Title": "Clearance Time Estimation for Assessing Evacuation Risk in Real-Time Evacuation Operations",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study seeks to develop an efficient approach for estimating clearance time for evacuation operations, which will be used to assess evacuation risk. The approach needs to be computationally efficient for use in real-time evacuation operations, while being capable of approximating traffic flow dynamics reasonably. An approach based on the framework of dynamic network flow problems (DNFPs) which serve as intermediate tools between static and dynamic traffic routing approaches to leverage the trade-offs between traffic realism approximation and computational efficiency is approached. By analyzing the characteristics of evacuation networks, a dynamic routing policy labeled the demand-priority routing is proposed. It defines the priority of demand in using roadway capacity for evacuation based on the associated spatial risk due to the disaster; the demand with higher priority is recommended for evacuation …",
        "Date": "2014-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2014,
        "Author": "Yu-Ting Hsu and Srinivas Peeta",
        "Title": "Risk-based spatial zone determination problem for stage-based evacuation operations",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study seeks to determine risk-based evacuation subzones for stage-based evacuation operations in a region threatened/affected by a disaster so that information-based evacuation strategies can be implemented in real-time for the subzone currently with highest evacuation risk to achieve some system-level performance objectives. Labeled the evacuation risk zone (ERZ), this subzone encompasses the spatial locations containing the population with highest evacuation risk which is a measure based on whether the population at a location can be safely evacuated before the disaster impacts it. The ERZ for a stage is calculated based on the evolving disaster characteristics, traffic demand pattern, and network supply conditions over the region in real-time subject to the resource limitations (personnel, equipment, etc.) of the disaster response operators related to implementing the evacuation strategies. Thereby …",
        "Date": "2014-01-01",
        "Pages": "73-89",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2014,
        "Author": "Yu-Ting Hsu and Srinivas Peeta",
        "Title": "Using Behavior-Consistent Information-Based Control for Traffic Routing in Real-Time Evacuation Operations",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "The evacuation operations problem aims to avoid or mitigate the potential loss of life in a region threatened/affected by a disaster. It is shaped by the evolution of evacuation traffic resulting from the demand-supply interactions of the associated transportation network. Information-based control is a strategic tool for evacuation traffic operations as it can enable greater access to the affected population and more effective response. This study develops a control module for evacuation operations centered on addressing the demand-supply interactions by using behavior-consistent information strategies. These strategies incorporate the likely responses of evacuees to the information provided in the determination of route guidance information. The control module works as an iterative computational process involving an evacuee route choice model and a control model of information strategies to determine the route …",
        "Date": "2014-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2013,
        "Author": "Yu-Ting Hsu",
        "Title": "A generalized operational framework for mass evacuation integrating demand, supply, and disaster characteristics",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "There has been an increasing focus in recent years on efficient response to large-scale disasters due to the severity of devastation under several natural and man-made disasters. From a transportation perspective, a key objective in this context is disaster-related mass evacuation to avoid/mitigate the potential loss of life. It addresses the movement of people (demand) from the region affected or threatened by a disaster to areas of safety using the available transportation system (supply). In an operational context, the mass evacuation problem is shaped by the dynamics of three underlying aspects: demand, supply, and disaster. Hence, it is critical to integrate the time-dependent effects, and consequent interactions, of these three aspects to determine effective evacuation strategies within a deployable framework. However, most current studies focus primarily on the supply-side management, while addressing the …",
        "Date": "2013-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2013,
        "Author": "Yu-Ting Hsu and Srinivas Peeta",
        "Title": "An aggregate approach to model evacuee behavior for no-notice evacuation operations",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study proposes an aggregate approach to model evacuee behavior in the context of no-notice evacuation operations. It develops aggregate behavior models for evacuation decision and evacuation route choice to support information-based control for the real-time stage-based routing of individuals in the affected areas. The models employ the mixed logit structure to account for the heterogeneity across the evacuees. In addition, due to the subjectivity involved in the perception and interpretation of the ambient situation and the information received, relevant fuzzy logic variables are incorporated within the mixed logit structure to capture these characteristics. Evacuation can entail emergent behavioral processes as the problem is characterized by a potential threat from the extreme event, time pressure, and herding mentality. Simulation experiments are conducted for a hypothetical terror attack to analyze …",
        "Date": "2013-01-01",
        "Pages": "671-696",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2011,
        "Author": "Yu-Ting Hsu and Srinivas Peeta",
        "Title": "Behavior Modeling for Information-Based No-Notice Evacuation",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This paper proposes an aggregate approach to model evacuation behavior in the context of no-notice evacuation operations. The aggregate behavior models for evacuation decision and evacuation route choice are developed to support information-based control by a system controller for the dynamic routing of individuals during evacuation operations in a stage-based framework. The proposed models employ the mixed logit structure to account for heterogeneity across the affected population. In addition, due to the subjectivity involved in the perception and interpretation of the ambient environment and information received, relevant fuzzy logic variables are incorporated to capture these characteristics. Simulation experiments for a hypothetical terror attack are conducted to estimate and validate the model’s ability to capture the assumed evacuation-related behavior at an aggregate level. The results illustrate the …",
        "Date": "2011-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2011,
        "Author": "Srinivas Peeta and Sushant Sharma and Yu-Ting Hsu",
        "Title": "Dynamic real-time routing for evacuation response planning and execution",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study addresses the problem of dynamic routing operations in the emergency response context, primarily in terms of the routing of response vehicles and evacuees. The study focuses on identifying the paths used for routing response vehicles and the evacuees in disaster situations. In this context, two application modules are developed: module for K-shortest paths routing and module for multiple-stop routing. The K-shortest paths module allows more flexible options for routing response vehicles under the dynamic network conditions due to a disaster. It provides multiple routes for evacuation and response operations. The multiple-stop routing module enables the delivery of relief resources to several locations using a single response vehicle. It has the ability to impose time window constraints for relief operations and the reordering of the routing to the delivery locations, capabilities which are critical to disaster operations.",
        "Date": "2011-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2009,
        "Author": "Srinivas Peeta and Yu-Ting Hsu",
        "Title": "Behavior modeling for dynamic routing under no-notice mass evacuation",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "Due to the potential for large-scale loss of life and property under natural or man-made disasters, there is a need for effective mass evacuation mechanisms. From a transportation perspective, the mass evacuation problem entails the dynamic routing of the affected population to safe areas as soon as possible. A key aspect for the effective routing of evacuees is the need to robustly model human behavior. The resulting problem is complex because of the randomness associated with the disaster characteristics as well as human behavior under disaster scenarios. In this study, we propose a behavior model for dynamic routing that captures evacuees' response to the changing network conditions and the effect of traffic information and route guidance from emergency management agencies.Depending on the disaster characteristics, evacuation problems can be categorized into short-notice evacuation (hurricane …",
        "Date": "2009-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2009,
        "Author": "Tang-Hsien Chang and Yu-Ting Hsu",
        "Title": "Dynamic Data Acquisition and Parameters Estimation for Traffic Prediction",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study proposes a real-time traffic data acquisition system and prediction algorithm. The framework of the system suggests taxi fleets as probe vehicles, combining roadside detectors to collect data from urban networks extensively. Then, mathematical models of “link travel time prediction” and “route flow estimation” are built based on generalized least squares and extended Kalman filter. To verify the prediction capability of the models, this study analyzed the results from grid network simulation. The models are proven well functioning with data processing and calibration. The mean errors of flow estimation on the generated network traffic flows are within 15%.",
        "Date": "2009-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    },
    {
        "Item Type": "journalArticle",
        "Publication Year": 2009,
        "Author": "Srinivas Peeta and Yu-Ting Hsu",
        "Title": "Integrating supply and demand aspects of transportation for mass evacuation under disasters.",
        "Short Title": "",
        "Publication Title": "",
        "DOI": "",
        "Url": "",
        "Abstract Note": "This study seeks to address real-time operational needs in the context of the evacuation response problem by providing a capability to dynamically route vehicles under evacuation, thereby being responsive to the actual conditions unfolding in real-time in the traffic network, both in terms of the evolving traffic patterns (demand-side) and the available road infrastructure in the aftermath of the disaster (supply-side). A key aspect in evacuation operations which is not well-understood is the interplay between route choice behavior and its effect on traffic and supply dynamics (i.e., composition of evacuation traffic, changes in roadway capacities, etc.). Evacuation traffic has historically been quantified with descriptive surveys characterizing the behavioral aspects from social or psychological contexts. Integration of these behavioral aspects into traffic and/or supply-side models has been limited. This study seeks to address such integration for generating realistic and effective evacuation strategies by focusing on developing behavioral models for no-notice mass evacuation. They include: (i) an evacuation participation decision model that determines whether an individual or a group of individuals would evacuate at the current time in a disaster context, and (ii) an evacuation route choice model that determines the routes taken by individuals or groups of individuals after they take a decision to evacuate. Under a comprehensive framework which integrates the management of demand- and supply-side components, this study focuses on the modeling of behavior under no-notice evacuation, which has rarely been emphasized in previous studies, especially in …",
        "Date": "2009-01-01",
        "Pages": "",
        "Issue": "",
        "Volume": "",
        "Library Catalog": "Google Scholar"
    }
]